[{"id":6,"id_bab":7,"isi":"Telah menceritakan kepada kami Abu Al Yaman berkata, telah mengabarkan kepada kami Syu'aib berkata, telah menceritakan kepada kami Abu Az Zanad dari Al A'raj dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maka demi Zat yang jiwaku di tangan-Nya, tidaklah beriman seorang dari kalian hingga aku lebih dicintainya daripada orang tuanya dan anaknya","created_at":"2017-07-16 20:32:47","updated_at":"2017-07-16 20:32:47"},{"id":7,"id_bab":7,"isi":"Telah menceritakan kepada kami Ya'qub bin Ibrahim berkata, telah menceritakan kepada kami Ibnu 'Ulayyah dari Abdul 'Aziz bin Shuhaib dari Anas dari Nabi shallallahu 'alaihi wasallam Dan telah menceritakan pula kepada kami Adam berkata, telah menceritakan kepada kami Syu'bah dari Qotadah dari Anas berkata, Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah beriman seorang dari kalian hingga aku lebih dicintainya daripada orang tuanya, anaknya dan dari manusia seluruhnya","created_at":"2017-07-16 20:33:14","updated_at":"2017-07-16 20:33:14"},{"id":8,"id_bab":8,"isi":"Telah menceritakan kepada kami Muhammad bin Al Mutsanna berkata, telah menceritakan kepada kami Abdul Wahhab Ats Tsaqafi berkata, telah menceritakan kepada kami Ayyub dari Abu Qilabah dari Anas bin Malik dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tiga perkara yang apabila ada pada diri seseorang, ia akan mendapatkan manisnya iman: Dijadikannya Allah dan Rasul-Nya lebih dicintainya dari selain keduanya. Jika \r\nia mencintai seseorang, dia tidak mencintainya kecuali karena Allah. Dan dia benci kembali kepada kekufuran seperti dia benci bila dilempar ke neraka","created_at":"2017-07-16 20:39:20","updated_at":"2017-07-16 20:39:20"},{"id":9,"id_bab":10,"isi":"Telah menceritakan kepada kami Muhammad bin Salam berkata, telah mengabarkan kepada kami 'Abdah dari Hisyam dari bapaknya dari Aisyah berkata: \"Rasulullah shallallahu 'alaihi wasallam bila memerintahkan kepada para sahabat, Beliau memerintahkan untuk melakukan amalan yang mampu mereka kerjakan, kemudian para sahabat berkata; \"Kami tidaklah seperti engkau, ya Rasulullah, karena engkau sudah diampuni dosa-dosa yang lalu dan yang akan datang\". Maka Beliau shallallahu 'alaihi wasallam menjadi marah yang dapat terlihat dari wajahnya, kemudian bersabda: \"Sesungguhnya yang paling taqwa dan paling mengerti tentang Allah diantara kalian adalah aku","created_at":"2017-07-16 20:46:06","updated_at":"2017-07-16 20:46:06"},{"id":10,"id_bab":11,"isi":"Telah menceritakan kepada kami Sulaiman bin Harb berkata, telah menceritakan kepada kami Syu'bah dari Qotadah dari Anas bin Malik dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tiga (perkara) yang apabila ada pada diri seseorang, ia akan mendapatkan manisnya iman: Allah dan Rasul-Nya lebih dicintainya dari selain keduanya. Dan siapa yang bila mencintai seseorang, dia tidak mencintai orang itu kecuali karena Allah 'azza wajalla. Dan siapa yang benci kembali kepada kekufuran seperti dia benci bila dilempar ke neraka","created_at":"2017-07-16 20:46:57","updated_at":"2017-07-16 20:46:57"},{"id":11,"id_bab":12,"isi":"Telah menceritakan kepada kami Isma'il berkata, telah menceritakan kepada kami Malik dari 'Amru bin Yahya Al Mazani dari bapaknya dari Abu Sa'id Al Khudri dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ahlu surga telah masuk ke surga dan Ahlu neraka telah masuk neraka. Lalu Allah Ta'ala berfirman: \"Keluarkan dari neraka siapa yang didalam hatinya ada iman sebesar biji sawi\". Maka mereka keluar dari neraka dalam kondisi yang telah menghitam gosong kemudian dimasukkan kedalam sungai hidup atau kehidupan. Malik ragu. - Lalu mereka tumbuh bersemi seperti tumbuhnya benih di tepi aliran sungai. Tidakkah kamu perhatikan bagaimana dia keluar dengan warna kekuningan.\"Berkata Wuhaib Telah menceritakan kepada kami 'Amru: \"Kehidupan\". Dan berkata: \"Sedikit dari kebaikan","created_at":"2017-07-16 20:48:20","updated_at":"2017-07-16 20:48:20"},{"id":12,"id_bab":12,"isi":"Telah menceritakan kepada kami Muhammad bin Ubaidillah berkata, telah menceritakan kepada kami Ibrahim bin Sa'd dari Shalih dari Ibnu Syihab dari Abu Umamah bin Sahal bin Hunaif bahwasanya dia mendengar Abu Said Al Khudri berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, aku bermimpi melihat orang-orang dihadapkan kepadaku. Mereka mengenakan baju, diantaranya ada yang sampai kepada buah dada dan ada yang kurang dari itu. Dan dihadapkan pula kepadaku Umar bin Al Khaththab dan dia mengenakan baju dan menyeretnya. Para sahabat bertanya: \"Apa maksudnya hal demikian menurut engkau, ya Rasulullah?\" Beliau shallallahu 'alaihi wasallam menjawab: \"Ad-Din (agama)","created_at":"2017-07-16 20:48:38","updated_at":"2017-07-16 20:48:38"},{"id":13,"id_bab":13,"isi":"Telah menceritakan kepada kami Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik bin Anas dari Ibnu Syihab dari Salim bin Abdullah dari bapaknya, bahwa Rasulullah shallallahu 'alaihi wasallam berjalan melewati seorang sahabat Anshar yang saat itu sedang memberi pengarahan saudaranya tentang malu. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tinggalkanlah dia, karena sesungguhnya malu adalah bagian dari iman","created_at":"2017-07-16 20:49:00","updated_at":"2017-07-16 20:49:00"},{"id":14,"id_bab":14,"isi":"Telah menceritakan kepada kami Abdullah bin Muhammad Al Musnadi dia berkata, Telah menceritakan kepada kami Abu Rauh Al Harami bin Umarah berkata, telah menceritakan kepada kami Syu'bah dari Waqid bin Muhammad berkata; aku mendengar bapakku menceritakan dari Ibnu Umar, bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Aku diperintahkan untuk memerangi manusia hingga mereka bersaksi; tidak ada ilah kecuali Allah dan bahwa sesungguhnya Muhammad adalah utusan Allah, menegakkan shalat, menunaikan zakat. Jika mereka lakukan yang demikian maka mereka telah memelihara darah dan harta mereka dariku kecuali dengan haq Islam dan perhitungan mereka ada pada Allah","created_at":"2017-07-16 20:51:43","updated_at":"2017-07-16 20:51:43"},{"id":15,"id_bab":15,"isi":"Telah menceritakan kepada kami Ahmad bin Yunus dan Musa bin Isma'il keduanya berkata, telah menceritakan kepada kami Ibrahim bin Sa'd berkata, telah menceritakan kepada kami Ibnu Syihab dari Sa'id bin Al Musayyab dari Abu Hurairah, bahwa Rasulullah \r\nshallallahu 'alaihi wasallam ditanya tentang Islam, manakah yang paling utama? Maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Iman kepada Allah dan Rasul-Nya\". Lalu ditanya lagi: \"Lalu apa?\" Beliau menjawab: \"Al Jihad fi sabilillah (berperang di jalan Allah). Lalu ditanya lagi: \"Kemudian apa lagi?\" Jawab Beliau shallallahu 'alaihi wasallam: \"haji mabrur","created_at":"2017-07-16 20:52:10","updated_at":"2017-07-16 20:52:10"},{"id":16,"id_bab":16,"isi":"Telah menceritakan kepada kami Qutaibah berkata, telah menceritakan kepada kami Al Laits dari Yazid bin Abu Habib dari Abu Al Khair dari Abdullah bin 'Amru bahwa ada seseorang bertanya kepada Rasulullah shallallahu 'alaihi wasallam; \"Islam manakah yang paling baik?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Kamu memberi makan dan memberi salam kepada orang yang kamu kenal dan yang tidak kamu kenal\".","created_at":"2017-07-16 20:52:51","updated_at":"2017-07-16 20:52:51"},{"id":17,"id_bab":17,"isi":"Telah menceritakan kepada kami Abdullah bin Maslamah dari Malik dari Zaid bin Aslam dari 'Atho' bin Yasar dari Ibnu 'Abbas berkata, Nabi shallallahu 'alaihi wasallam bersabda: \"Aku diperlihatkan neraka, ternyata kebanyakan penghuninya adalah wanita. Karena mereka sering mengingkari\". Ditanyakan: \"Apakah mereka mengingkari Allah?\" Beliau bersabda: \"Mereka mengingkari pemberian suami, mengingkari kebaikan. Seandainya kamu berbuat baik terhadap seseorang dari mereka sepanjang masa, lalu dia melihat satu saja kejelekan darimu maka dia akan berkata: 'aku belum pernah melihat kebaikan sedikitpun darimu\".","created_at":"2017-07-16 20:53:21","updated_at":"2017-07-16 20:53:21"},{"id":18,"id_bab":18,"isi":"Telah menceritakan kepada kami Sulaiman bin Harb berkata, telah menceritakan kepada kami Syu'bah dari Washil Al Ahdab dari Al Ma'rur bin Suwaid berkata: Aku bertemu Abu Dzar di Rabdzah yang saat itu mengenakan pakaian dua lapis, begitu juga anaknya, maka aku tanyakan kepadanya tentang itu, maka dia menjawab: Aku telah menghina seseorang \r\ndengan cara menghina ibunya, maka Nabi shallallahu 'alaihi wasallam menegurku: \"Wahai Abu Dzar apakah kamu menghina ibunya? Sesungguhnya kamu masih memiliki (sifat) jahiliyyah. Saudara-saudara kalian adalah tanggungan kalian, Allah telah menjadikan mereka di bawah tangan kalian. Maka siapa yang saudaranya berada di bawah tangannya (tanggungannya) maka jika dia makan berilah makanan seperti yang dia makan, bila dia berpakaian berilah seperti yang dia pakai, janganlah kalian membebani mereka sesuatu yang di luar batas kemampuan mereka. Jika kalian membebani mereka, maka bantulah mereka\".","created_at":"2017-07-16 20:53:49","updated_at":"2017-07-16 20:53:49"},{"id":19,"id_bab":19,"isi":"Telah menceritakan kepada kami Abdurrahman bin Al Mubarak Telah menceritakan kepada kami Hammad bin Zaid Telah menceritakan kepada kami Ayyub dan Yunus dari Al Hasan dari Al Ahnaf bin Qais berkata; aku datang untuk menolong seseorang kemudian bertemu Abu Bakrah, maka dia bertanya: \"Kamu mau kemana?\" Aku jawab: \"hendak menolong seseorang\" dia berkata: \"Kembalilah, karena aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika dua orang muslim saling bertemu (untuk berkelahi) dengan menghunus pedang masing-masing, maka yang terbunuh dan membunuh masuk neraka\". aku pun bertanya: \"Wahai Rasulullah, ini bagi yang membunuh, tapi bagaimana dengan yang terbunuh?\" Maka Nabi shallallahu 'alaihi wasallam menjawab: \"Dia juga sebelumnya sangat ingin untuk membunuh temannya\".","created_at":"2017-07-16 20:54:16","updated_at":"2017-07-16 20:54:16"},{"id":20,"id_bab":20,"isi":"Telah menceritakan kepada kami Abu Al Walid berkata, telah menceritakan kepada kami Syu'bah dan juga telah meriwayatkan hadits yang serupa ini, Telah menceritakan kepadaku Bisyir bin Khalid Abu Muhammad Al 'Asykari berkata, telah menceritakan kepada kami Muhammad bin Ja'far dari Syu'bah dari Sulaiman dari Ibrahim dari Alqamah dari Abdullah berkata: ketika turun ayat: \"Orang-orang beriman dan tidak mencampur adukkan iman mereka dengan kezhaliman\" para sahabat Rasulullah shallallahu 'alaihi wasallam bertanya: \r\n\"Siapakah diantara kami yang tidak berbuat zhalim? Maka Allah 'azza wajalla menurunkan (firman-Nya): \"Sesungguhnya kesyirikan adalah kezhaliman yang besar\". (QS. Luqman: 13)","created_at":"2017-07-16 20:55:38","updated_at":"2017-07-16 20:55:38"},{"id":21,"id_bab":21,"isi":"Telah menceritakan kepada kami Sulaiman Abu ar Rabi' berkata, telah menceritakan kepada kami Isma'il bin Ja'far berkata, telah menceritakan kepada kami Nafi' bin Malik bin Abu 'Amir Abu Suhail dari bapaknya dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tanda-tanda munafiq ada tiga; jika berbicara dusta, jika berjanji mengingkari dan jika diberi amanat dia khianat\"","created_at":"2017-07-16 20:57:21","updated_at":"2017-07-16 20:57:21"},{"id":22,"id_bab":21,"isi":"Telah menceritakan kepada kami Qabishah bin 'Uqbah berkata, telah menceritakan kepada kami Sufyan dari Al A'masy dari Abdullah bin Murrah dari Masruq dari Abdullah bin 'Amru bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Empat hal bila ada pada seseorang maka dia adalah seorang munafiq tulen, dan barangsiapa yang terdapat pada dirinya satu sifat dari empat hal tersebut maka pada dirinya terdapat sifat nifaq hingga dia meninggalkannya. Yaitu, jika diberi amanat dia khianat, jika berbicara dusta, jika berjanji mengingkari dan jika berseteru curang\". Hadits ini diriwayatkan pula oleh Syu'bah dari Al A'masy","created_at":"2017-07-16 20:58:41","updated_at":"2017-07-16 20:58:41"},{"id":23,"id_bab":22,"isi":"Telah menceritakan kepada kami Abu Al Yaman berkata, telah mengabarkan kepada kami Syu'aib berkata, telah menceritakan kepada kami Abu Al Zanad dari Al A'raj dari Abu Hurairah berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menegakkan lailatul qodar karena iman dan mengharap pahala, maka diampuni dosadosanya yang telah lalu\".","created_at":"2017-07-16 20:59:08","updated_at":"2017-07-16 20:59:08"},{"id":24,"id_bab":25,"isi":"Telah menceritakan kepada kami Muhammad bin Salam berkata, telah mengabarkan kepada kami Muhammad bin Fudlail berkata, telah menceritakan kepada kami Yahya bin Sa'id dari Abu Salamah dari Abu Hurairah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berpuasa karena iman dan mengharap pahala, maka diampuni dosa-dosanya yang telah lalu\".","created_at":"2017-07-16 21:00:23","updated_at":"2017-07-16 21:00:23"},{"id":25,"id_bab":27,"isi":"Telah menceritakan kepada kami 'Amru bin Khalid berkata, telah menceritakan kepada kami Zuhair berkata, telah menceritakan kepada kami Abu Ishaq dari Al Barro` bin 'Azib bahwa Nabi shallallahu 'alaihi wasallam saat pertama kali datang di Madinah, singgah pada kakek-kakeknya ('Azib) atau paman-pamannya dari Kaum Anshar, dan saat itu Beliau shallallahu 'alaihi wasallam shalat menghadap Baitul Maqdis selama enam belas bulan atau tujuh belas bulan, dan Beliau sangat senang sekali kalau shalat menghadap Baitullah (Ka'bah). Shalat yang dilakukan Beliau shallallahu 'alaihi wasallam pertama kali (menghadap Ka'bah) itu adalah shalat 'ashar dan orang-orang juga ikut shalat bersama Beliau. Pada suatu hari sahabat yang ikut shalat bersama Nabi shallallahu 'alaihi wasallam pergi melewati orang-orang di Masjid lain saat mereka sedang ruku', maka dia berkata: \"Aku bersaksi kepada Allah bahwa aku ikut shalat bersama Rasulullah shallallahu 'alaihi wasallam menghadap Makkah, maka orang-orang yang sedang (ruku') tersebut berputar menghadap \r\nBaitullah dan orang-orang Yahudi dan Ahlul Kitab menjadi heran, sebab sebelumnya Nabi shallallahu 'alaihi wasallam shalat menghadap Baitul Maqdis. Ketika melihat Nabi shallallahu 'alaihi wasallam menghadapkan wajahnya ke Baitullah mereka mengingkari hal ini. Berkata Zuhair Telah menceritakan kepada kami Abu Ishaq dari Al Barro`, dalam haditsnya ini menerangkan tentang (hukum) seseorang yang meninggal dunia pada saat arah qiblat belum dialihkan dan juga banyak orang-orang yang terbunuh pada masa itu?, kami tidak tahu apa yang harus kami sikapi tentang mereka hingga akhirnya Allah Ta'ala menurunkan firmanNya: \"Dan Allah tidaklah akan menyia-nyiakan iman kalian\". (QS. Al Baqoroh: 143)","created_at":"2017-07-16 21:02:10","updated_at":"2017-07-16 21:02:10"},{"id":26,"id_bab":29,"isi":"Telah menceritakan kepada kami Muhammad bin Al Mutsanna berkata, telah menceritakan kepada kami Yahya dari Hisyam berkata, telah mengabarkan bapakku kepadaku dari Aisyah bahwa Nabi shallallahu 'alaihi wasallam mendatanginya dan bersamanya ada seorang wanita lain, lalu Nabi shallallahu 'alaihi wasallam bertanya: \"siapa ini?\" Aisyah menjawab: \"si fulanah\", Lalu diceritakan tentang shalatnya. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"tinggalkanlah apa yang tidak kalian sanggupi, demi Allah, Allah tidak akan bosan hingga kalian sendiri yang menjadi bosan, dan agama yang paling dicintai-Nya adalah apa yang senantiasa dikerjakan secara rutin dan kontinyu\".","created_at":"2017-07-16 21:02:56","updated_at":"2017-07-16 21:02:56"},{"id":27,"id_bab":30,"isi":"Telah menceritakan kepada kami Muslim bin Ibrahim berkata, telah menceritakan kepada kami Hisyam berkata, telah menceritakan kepada kami Qotadah dari Anas dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Akan dikeluarkan dari neraka siapa yang mengatakan tidak ada Ilah kecuali Allah dan dalam hatinya ada kebaikan sebesar jemawut. Dan akan dikeluarkan dari neraka siapa yang mengatakan tidak ada ilah kecuali Allah dan dalam hatinya ada kebaikan sebesar biji gandum. Dan akan dikeluarkan dari neraka siapa yang mengatakan tidak ada ilah kecuali Allah dan dalam hatinya ada kebaikan sebesar biji sawi. Abu Abdullah berkata; Aban berkata; Telah menceritakan kepada kami Qotadah Telah menceritakan kepada kami Anas dari Nabi shallallahu 'alaihi wasallam, beliau bersabda. Dan kata iman di dalam hadits ini diganti dengan kata kebaikan.","created_at":"2017-07-16 21:03:20","updated_at":"2017-07-16 21:03:20"},{"id":28,"id_bab":30,"isi":"Telah menceritakan kepada kami Al Hasan bin Ash Shabbah bahwa dia mendengar Ja'far bin 'Aun berkata; Telah menceritakan kepada kami Abu Al 'Umais, telah mengabarkan kepada kami Qais bin Muslim dari Thariq bin Syihab dari Umar bin Al Khaththab; Ada seorang laki-laki Yahudi berkata: \"Wahai Amirul Mu'minin, ada satu ayat dalam kitab kalian yang kalian baca, seandainya ayat itu diturunkan kepada kami Kaum Yahudi, tentulah kami jadikan (hari diturunkannya ayat itu) sebagai hari raya ('ied). Maka Umar bin Al Khaththab berkata: \"Ayat apakah itu?\" (Orang Yahudi itu) berkata: \"Pada hari ini telah Kusempurnakan untuk kalian agama kalian, dan telah Ku-cukupkan kepada kalian nikmat-Ku, dan telah Kuridhai Islam itu jadi agama bagi kalian\". (QS. Al Maidah ayat 3). Maka Umar bin Al Khaththab menjawab: \"Kami tahu hari tersebut dan dimana tempat diturunkannya ayat tersebut kepada Nabi shallallahu 'alaihi wasallam, yaitu pada hari Jum'at ketika Beliau shallallahu 'alaihi wasallam berada di 'Arafah.","created_at":"2017-07-16 21:03:31","updated_at":"2017-07-16 21:03:31"},{"id":29,"id_bab":31,"isi":"Telah menceritakan kepada kami Isma'il Telah menceritakan kepadaku Malik bin Anas dari pamannya - Abu Suhail bin Malik - dari bapaknya, bahwa dia mendengar Thalhah bin 'Ubaidullah berkata: Telah datang kepada Rasulullah shallallahu 'alaihi wasallam seorang dari penduduk Najed dalam keadaan kepalanya penuh debu dengan suaranya yang keras terdengar, namun tidak dapat dimengerti apa maksud yang diucapkannya, hingga mendekat (kepada Nabi shallallahu 'alaihi wasallam) kemudian dia bertanya tentang Islam, maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Shalat lima kali dalam sehari semalam\". Kata orang itu: \"apakah ada lagi selainnya buatku\". Nabi shallallahu 'alaihi wasallam menjawab: \"Tidak ada kecuali yang thathawu' (sunnat) \". Rasulullah shallallahu 'alaihi wasallam berkata: \"Dan puasa Ramadlan\". Orang itu bertanya lagi: \"Apakah ada lagi selainnya buatku\". Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak ada kecuali yang thathawu' (sunnat) \". Lalu Rasulullah shallallahu 'alaihi wasallam menyebut: \"Zakat\": Kata orang itu: \"apakah ada lagi selainnya buatku\". Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak ada kecuali yang thathawu' (sunnat) \". Thalhah bin 'Ubaidullah berkata: Lalu orang itu pergi sambil berkata: \"Demi Allah, aku tidak akan menambah atau menguranginya\". Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dia akan beruntung jika jujur menepatinya\"","created_at":"2017-07-16 21:03:53","updated_at":"2017-07-16 21:03:53"},{"id":30,"id_bab":32,"isi":"Telah menceritakan kepada kami Ahmad bin Abdullah bin Ali Al Manjufi berkata, telah menceritakan kepada kami Rauh berkata, telah menceritakan kepada kami 'Auf dari Al Hasan dan Muhammad dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Barangsiapa mengiringi jenazah muslim, karena iman dan mengharapkan balasan dan dia selalu bersama jenazah tersebut sampai dishalatkan dan selesai dari penguburannya, maka dia pulang dengan membawa dua qiroth, setiap qiroth setara dengan gunung Uhud. Dan barangsiapa menyolatkannya dan pulang sebelum dikuburkan maka dia pulang membawa satu qiroth\". Hadits seperti ini juga diriwayatkan dari Utsman Al Mu`adzin, dia \r\nberkata; telah menceritakan kepada kami 'Auf dari Muhammad dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam.","created_at":"2017-07-16 21:04:14","updated_at":"2017-07-16 21:04:14"},{"id":31,"id_bab":33,"isi":"Telah menceritakan kepada kami Muhammad bin 'Ar'arah berkata, Telah menceritakan kepada kami Syu'bah dari Zubaid berkata: Aku bertanya kepada Abu Wa'il tentang Murji`ah, maka dia menjawab: Telah menceritakan kepadaku Abdullah bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"mencerca orang muslim adalah fasiq dan memeranginya adalah kufur\".","created_at":"2017-07-16 21:04:40","updated_at":"2017-07-16 21:04:40"},{"id":32,"id_bab":33,"isi":"Telah mengabarkan kepada kami Qutaibah bin Sa'id Telah menceritakan kepada kami Isma'il bin Ja'far dari Humaid, Telah menceritakan kepadaku Anas bin Malik berkata, telah mengabarkan kepadaku 'Ubadah bin Ash Shamit, bahwa Rasulullah shallallahu 'alaihi wasallam keluar untuk menjelaskan tentang Lailatul Qodar, lalu ada dua orang muslimin saling berdebat. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Aku datang untuk menjelaskan Lailatul Qodar kepada kalian, namun fulan dan fulan saling berdebat sehingga akhirnya diangkat (lailatul qodar), dan semoga menjadi lebih baik buat kalian, maka itu intailah (lailatul qodar) itu pada hari yang ketujuh, enam dan lima \".","created_at":"2017-07-16 21:04:47","updated_at":"2017-07-16 21:04:47"},{"id":33,"id_bab":34,"isi":"Telah menceritakan kepada kami Musaddad berkata, Telah menceritakan kepada kami Isma'il bin Ibrahim telah mengabarkan kepada kami Abu Hayyan At Taimi dari Abu Zur'ah dari Abu Hurairah berkata; bahwa Nabi shallallahu 'alaihi wasallam pada suatu hari muncul kepada para sahabat, lalu datang Malaikat Jibril 'Alaihis Salam yang kemudian bertanya: \"Apakah iman itu?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Iman adalah kamu beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, pertemuan dengan-Nya, Rasul-RasulNya, dan kamu beriman kepada hari berbangkit\". (Jibril 'Alaihis salam) berkata: \"Apakah Islam itu?\" Jawab Nabi shallallahu 'alaihi wasallam: \"Islam adalah kamu menyembah Allah dan tidak menyekutukannya dengan suatu apapun, kamu dirikan shalat, kamu tunaikan zakat yang diwajibkan, dan berpuasa di bulan Ramadlan\". (Jibril 'Alaihis salam) berkata: \"Apakah ihsan itu?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Kamu menyembah Allah seolah-olah melihat-Nya dan bila kamu \r\ntidak melihat-Nya sesungguhnya Dia melihatmu\". (Jibril 'Alaihis salam) berkata lagi: \"Kapan terjadinya hari kiamat?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Yang ditanya tentang itu tidak lebih tahu dari yang bertanya. Tapi aku akan terangkan tanda-tandanya; (yaitu); jika seorang budak telah melahirkan tuannya, jika para penggembala unta yang berkulit hitam berlomba-lomba membangun gedung-gedung selama lima masa, yang tidak diketahui lamanya kecuali oleh Allah\". Kemudian Nabi shallallahu 'alaihi wasallam membaca: \"Sesungguhnya hanya pada Allah pengetahuan tentang hari kiamat\" (QS. Luqman: 34). Setelah itu Jibril 'Alaihis salam pergi, kemudian Nabi shallallahu 'alaihi wasallam berkata; \"hadapkan dia ke sini.\" Tetapi para sahabat tidak melihat sesuatupun, maka Nabi bersabda; \"Dia adalah Malaikat Jibril datang kepada manusia untuk mengajarkan agama mereka.\" Abu Abdullah berkata: \"Semua hal yang diterangkan Beliau shallallahu 'alaihi wasallam dijadikan sebagai iman.","created_at":"2017-07-16 21:05:10","updated_at":"2017-07-16 21:05:10"},{"id":34,"id_bab":34,"isi":"Telah menceritakan kepada kami Ibrahim bin Hamzah berkata, telah menceritakan kepada kami Ibrahim bin Sa'd dari Shalih dari Ibnu Syihab dari Ubaidillah bin Abdullah bahwa Abdullah bin 'Abbas mengabarkan kepadanya, bahwa dia berkata; telah mengabarkan kepadaku Abu Sufyan bin Harb bahwa Heraqlius berkata kepadanya: \"Aku sudah bertanya kepadamu, apakah jumlah mereka bertambah atau berkurang? Maka kamu bertutur bahwa mereka bertambah, dan memang begitulah iman akan terus berkembang hingga sempurna. Dan aku bertanya kepadamu, apakah ada orang yang murtad karena dongkol pada agamanya? Kemudian kamu bertutur; tidak ada, maka begitu juga iman bila sudah tumbuh bersemi dalam hati tidak akan ada yang dongkol kepadanya\".","created_at":"2017-07-16 21:05:18","updated_at":"2017-07-16 21:05:18"},{"id":35,"id_bab":35,"isi":"Telah menceritakan kepada kami Abu Nu'aim Telah menceritakan kepada kami Zakaria dari 'Amir berkata; aku mendengar An Nu'man bin Basyir berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang halal sudah jelas dan yang haram juga sudah jelas. Namun diantara keduanya ada perkara syubhat (samar) yang tidak diketahui oleh banyak orang. Maka barangsiapa yang menjauhi diri dari yang syubhat berarti telah memelihara agamanya dan kehormatannya. Dan barangsiapa yang sampai jatuh (mengerjakan) pada perkara-perkara syubhat, sungguh dia seperti seorang penggembala yang menggembalakan ternaknya di pinggir jurang yang dikhawatirkan akan jatuh ke dalamnya. Ketahuilah bahwa setiap raja memiliki batasan, dan ketahuilah bahwa batasan larangan Allah di bumi-Nya adalah apa-apa yang diharamkan-Nya. Dan ketahuilah pada setiap tubuh ada segumpal darah yang apabila baik maka baiklah tubuh tersebut dan apabila rusak maka rusaklah tubuh tersebut. Ketahuilah, ia adalah hati\".","created_at":"2017-07-16 21:05:36","updated_at":"2017-07-16 21:05:36"},{"id":36,"id_bab":36,"isi":"Telah menceritakan kepada kami Abdullah bin Maslamah berkata, telah mengabarkan kepada kami Malik dari Yahya bin Sa'id dari Muhammad bin Ibrahim dari Alqamah bin Waqash dari Umar, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semua perbuatan tergantung niatnya, dan (balasan) bagi tiap-tiap orang (tergantung) apa yang diniatkan; barangsiapa niat hijrahnya karena Allah dan Rasul-Nya, maka hijrahnya adalah kepada Allah dan Rasul-Nya. Barangsiapa niat hijrahnya karena dunia yang ingin digapainya atau karena seorang perempuan yang ingin dinikahinya, maka hijrahnya adalah kepada apa dia diniatkan.\".","created_at":"2017-07-16 21:06:01","updated_at":"2017-07-16 21:06:01"},{"id":37,"id_bab":36,"isi":"Telah menceritakan kepada kami Hajjaj bin Minhal berkata, telah menceritakan kepada kami Syu'bah berkata, telah mengabarkan kepadaku 'Adi bin Tsabit berkata: Aku pernah mendengar Abdullah bin Yazid dari Abu Mas'ud dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila seseorang memberi nafkah untuk keluarganya dengan niat mengharap pahala maka baginya Sedekah\".","created_at":"2017-07-16 21:06:08","updated_at":"2017-07-16 21:06:08"},{"id":38,"id_bab":37,"isi":"Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepada kami Yahya dari Isma'il berkata, telah menceritakan kepadaku Qais bin Abu Hazim dari Jarir bin Abdullah berkata: \"Aku telah membai'at Rasulullah untuk menegakkan shalat, menunaikan zakat dan menasehati kepada setiap muslim\".","created_at":"2017-07-16 21:06:25","updated_at":"2017-07-16 21:06:25"},{"id":39,"id_bab":37,"isi":"Telah menceritakan kepada kami Abu An Nu'man berkata, telah menceritakan kepada kami Abu 'Awanah dari Ziyad bin 'Alaqah berkata; saya mendengar Jarir bin Abdullah berkata \r\nketika Al Mughirah bin Syu'bah meninggal, sambil berdiri dia memuji Allah dan mensucikanNya, berkata: \"Wajib atas kalian bertakwa kepada Allah satu-satunya dan tidak menyekutukannya, dan dengan penuh ketundukan dan ketenangan sampai datang pemimpin pengganti, dan sekarang datang penggantinya, \" kemudian dia berkata: \"Mintakanlah maaf kepada Allah Subhanahu wa Ta'ala buat pemimpin kalian ini (Al Mughirah), karena dia suka memberi maaf.\" Lalu berkata: \"Amma ba'du, sesungguhnya aku mendatangi Nabi shallallahu 'alaihi wasallam kemudian aku berkata: \"Aku membai'at engkau untuk Islam\". Lalu Nabi shallallahu 'alaihi wasallam memberi syarat dan menasehati kepada setiap muslim, maka aku membai'at Beliau untuk perkara itu, dan demi Pemilik Masjid ini, sungguh aku akan selalu memberi nasihat kepada kalian\" Kemudian dia beristighfar lalu turun dari mimbar.","created_at":"2017-07-16 21:06:35","updated_at":"2017-07-16 21:06:35"},{"id":40,"id_bab":38,"isi":"Telah menceritakan kepada kami Muhammad bin Sinan berkata, telah menceritakan kepada kami Fulaih. Dan telah diriwayatkan pula hadits serupa dari jalan lain, yaitu Telah menceritakan kepadaku Ibrahim bin Al Mundzir berkata, telah menceritakan kepada kami Muhammad bin Fulaih berkata, telah menceritakan kepadaku bapakku berkata, telah menceritakan kepadaku Hilal bin Ali dari Atho' bin Yasar dari Abu Hurairah berkata: Ketika Nabi shallallahu 'alaihi wasallam berada dalam suatu majelis membicarakan suatu kaum, tiba-tiba datanglah seorang Arab Badui lalu bertanya: \"Kapan datangnya hari kiamat?\" Namun Nabi shallallahu 'alaihi wasallam tetap melanjutkan pembicaraannya. Sementara itu sebagian kaum ada yang berkata; \"beliau mendengar perkataannya akan tetapi beliau tidak menyukai apa yang dikatakannya itu, \" dan ada pula sebagian yang mengatakan; \"bahwa beliau tidak mendengar perkataannya.\" Hingga akhirnya Nabi shallallahu 'alaihi wasallam menyelesaikan pembicaraannya, seraya berkata: \"Mana orang yang bertanya tentang hari kiamat tadi?\" Orang itu berkata: \"saya wahai Rasulullah!\". Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila sudah hilang amanah maka tunggulah terjadinya kiamat\". Orang itu bertanya: \"Bagaimana hilangnya amanat itu?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Jika urusan diserahkan bukan kepada ahlinya, maka akan tunggulah terjadinya kiamat\".","created_at":"2017-07-16 21:07:22","updated_at":"2017-07-16 21:07:22"},{"id":41,"id_bab":39,"isi":"Telah menceritakan kepada kami Abu An Nu'man 'Arim bin Al Fadlal berkata, telah menceritakan kepada kami Abu 'Awanah dari Abu Bisyir dari Yusuf bin Mahak dari Abdullah bin 'Amru berkata: Nabi shallallahu 'alaihi wasallam pernah tertinggal dari kami dalam suatu perjalanan yang kami lakukan hingga Beliau mendapatkan kami sementara waktu shalat sudah hampir habis, kami berwudlu' dengan hanya mengusap kaki kami. Maka Nabi shallallahu 'alaihi wasallam berseru dengan suara yang keras: \"celakalah bagi tumit-tumit yang tidak basah akan masuk neraka.\" Beliau serukan hingga dua atau tiga kali.","created_at":"2017-07-16 21:07:44","updated_at":"2017-07-16 21:07:44"},{"id":42,"id_bab":40,"isi":"Telah menceritakan kepada kami Khalid bin Makhlad Telah menceritakan kepada kami Sulaiman Telah menceritakan kepada kami Abdullah bin Dinar dari Ibnu Umar dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya diantara pohon ada satu pohon yang tidak jatuh daunnya. Dan itu adalah perumpamaan bagi seorang muslim\". Nabi shallallahu 'alaihi wasallam bertanya: \"Katakanlah padaku, pohon apakah itu?\" Maka para sahabat beranggapan bahwa yang dimaksud adalah pohon yang berada di lembah. Abdullah berkata: Aku berpikir dalam hati pohon itu adalah pohon kurma, tapi aku malu \r\nmengungkapkannya. Kemudian orang-orang berkata: \"Wahai Rasulullah, pohon apakah itu?\" Beliau shallallahu 'alaihi wasallam menjawab: \"Pohon kurma\".","created_at":"2017-07-16 21:08:22","updated_at":"2017-07-16 21:08:22"},{"id":43,"id_bab":41,"isi":"Telah menceritakan kepada kami Abdullah bin Yusuf berkata, telah menceritakan kepada kami Al Laits dari Sa'id Al Maqburi dari Syarik bin Abdullah bin Abu Namir bahwa dia mendengar Anas bin Malik berkata: Ketika kami sedang duduk-duduk bersama Nabi shallallahu 'alaihi wasallam didalam Masjid, ada seorang yang menunggang unta datang lalu menambatkannya di dekat Masjid lalu berkata kepada mereka (para sahabat): \"Siapa diantara kalian yang bernama Muhammad?\" Pada saat itu Nabi shallallahu 'alaihi wasallam bersandaran di tengah para sahabat, lalu kami menjawab: \"orang Ini, yang berkulit putih yang sedang bersandar\". Orang itu berkata kepada Beliau; \"Wahai putra Abdul Muththalib\" Nabi shallallahu 'alaihi wasallam menjawab: \"Ya, aku sudah menjawabmu\". Maka orang itu berkata kepada Nabi shallallahu 'alaihi wasallam: \"Aku bertanya kepadamu persoalan yang mungkin berat buatmu namun janganlah kamu merasakan sesuatu terhadapku.\" Maka Nabi shallallahu 'alaihi wasallam menjawab: \"Tanyalah apa yang menjadi persoalanmu\". Orang itu berkata: \"Aku bertanya kepadamu demi Rabbmu dan Rabb orang-orang sebelummu. Apakah Allah yang mengutusmu kepada manusia seluruhnya?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang itu: \"Aku bersumpah kepadamu atas nama Allah, apakah Allah yang memerintahkanmu supaya kami shalat lima (waktu) dalam sehari semalam?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang \r\nitu: \"Aku bersumpah kepadamu atas nama Allah, apakah Allah yang memerintahkanmu supaya kami puasa di bulan ini dalam satu tahun?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang itu: \"Aku bersumpah kepadamu atas nama Allah, apakah Allah yang memerintahkanmu supaya mengambil sedekah dari orang-orang kaya di antara kami lalu membagikannya kepada orang-orang fakir diantara kami?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang itu: \"Aku beriman dengan apa yang engkau bawa dan aku adalah utusan kaumku, aku Dlamam bin Tsa'labah saudara dari Bani Sa'd bin Bakr.\" Begitulah (kisah tadi) sebagaimana yang diriwayatkan oleh Musa bin Isma'il dan Ali bin Abdul Hamid dari Sulaiman bin Al Mughirah dari Tsabit dari Anas dari Nabi shallallahu 'alaihi wasallam","created_at":"2017-07-16 21:08:52","updated_at":"2017-07-16 21:08:52"},{"id":44,"id_bab":41,"isi":"Telah menceritakan kepada kami Abdullah bin Yusuf berkata, telah menceritakan kepada kami Al Laits dari Sa'id Al Maqburi dari Syarik bin Abdullah bin Abu Namir bahwa dia mendengar Anas bin Malik berkata: Ketika kami sedang duduk-duduk bersama Nabi shallallahu 'alaihi wasallam didalam Masjid, ada seorang yang menunggang unta datang lalu menambatkannya di dekat Masjid lalu berkata kepada mereka (para sahabat): \"Siapa diantara kalian yang bernama Muhammad?\" Pada saat itu Nabi shallallahu 'alaihi wasallam bersandaran di tengah para sahabat, lalu kami menjawab: \"orang Ini, yang berkulit putih yang sedang bersandar\". Orang itu berkata kepada Beliau; \"Wahai putra Abdul Muththalib\" Nabi shallallahu 'alaihi wasallam menjawab: \"Ya, aku sudah menjawabmu\". Maka orang itu berkata kepada Nabi shallallahu 'alaihi wasallam: \"Aku bertanya kepadamu persoalan yang mungkin berat buatmu namun janganlah kamu merasakan sesuatu terhadapku.\" Maka Nabi shallallahu 'alaihi wasallam menjawab: \"Tanyalah apa yang menjadi persoalanmu\". Orang itu berkata: \"Aku bertanya kepadamu demi Rabbmu dan Rabb orang-orang sebelummu. Apakah Allah yang mengutusmu kepada manusia seluruhnya?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang itu: \"Aku bersumpah kepadamu atas nama Allah, apakah Allah yang memerintahkanmu supaya kami shalat lima (waktu) dalam sehari semalam?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang \r\nitu: \"Aku bersumpah kepadamu atas nama Allah, apakah Allah yang memerintahkanmu supaya kami puasa di bulan ini dalam satu tahun?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang itu: \"Aku bersumpah kepadamu atas nama Allah, apakah Allah yang memerintahkanmu supaya mengambil sedekah dari orang-orang kaya di antara kami lalu membagikannya kepada orang-orang fakir diantara kami?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Demi Allah, ya benar!\" Kata orang itu: \"Aku beriman dengan apa yang engkau bawa dan aku adalah utusan kaumku, aku Dlamam bin Tsa'labah saudara dari Bani Sa'd bin Bakr.\" Begitulah (kisah tadi) sebagaimana yang diriwayatkan oleh Musa bin Isma'il dan Ali bin Abdul Hamid dari Sulaiman bin Al Mughirah dari Tsabit dari Anas dari Nabi shallallahu 'alaihi wasallam","created_at":"2017-07-16 21:08:53","updated_at":"2017-07-16 21:08:53"},{"id":45,"id_bab":42,"isi":"Telah menceritakan kepada kami Isma'il berkata, telah menceritakan kepadaku Malik dari Ishaq bin Abdullah bin Abu Thalhah bahwa Abu Murrah -mantan budak Uqail bin Abu Thalib-, mengabarkan kepadanya dari Abu Waqid Al Laitsi, bahwa Rasulullah shallallahu 'alaihi wasallam ketika sedang duduk bermajelis di Masjid bersama para sahabat datanglah tiga orang. Yang dua orang menghadap Nabi shallallahu 'alaihi wasallam dan yang seorang lagi pergi, yang dua orang terus duduk bersama Nabi shallallahu 'alaihi wasallam dimana satu diantaranya nampak berbahagia bermajelis bersama Nabi shallallahu 'alaihi wasallam sedang yang kedua duduk di belakang mereka, sedang yang ketiga berbalik pergi, Setelah Rasulullah shallallahu 'alaihi wasallam selesai bermajelis, Beliau bersabda: \"Maukah kalian aku beritahu tentang ketiga orang tadi?\" Adapun seorang diantara mereka, dia meminta perlindungan kepada Allah, maka Allah lindungi dia. Yang kedua, dia malu kepada Allah, maka Allah pun malu kepadanya. Sedangkan yang ketiga berpaling dari Allah maka Allah pun berpaling darinya\".","created_at":"2017-07-16 21:09:22","updated_at":"2017-07-16 21:09:22"},{"id":46,"id_bab":43,"isi":"Telah menceritakan kepada kami Muhammad bin Yusuf berkata, telah mengabarkan kepada kami Sufyan dari Al A'masy dari Abu Wa'il dari Ibnu Mas'ud berkata; bahwa Nabi shallallahu 'alaihi wasallam memperingatkan kami dengan suatu pelajaran tentang hari-hari yang sulit yang akan kami hadapi.","created_at":"2017-07-16 21:10:15","updated_at":"2017-07-16 21:10:15"},{"id":47,"id_bab":43,"isi":"Telah menceritakan kepada kami Muhammad bin Basysyar berkata, telah menceritakan kepada kami Yahya bin Sa'id berkata, telah menceritakan kepada kami Syu'bah Telah menceritakan kepadaku Abu At Tayyah dari Anas bin Malik dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"permudahlah dan jangan persulit, berilah kabar gembira dan jangan membuat orang lari.\"","created_at":"2017-07-16 21:10:26","updated_at":"2017-07-16 21:10:26"},{"id":48,"id_bab":44,"isi":"Telah menceritakan kepada kami Ali bin Abdullah Telah menceritakan kepada kami Sufyan berkata, telah berkata kepadaku Ibnu Abu Najih dari Mujahid berkata; aku pernah menemani Ibnu Umar pergi ke Madinah, namun aku tidak mendengar dia membicarakan tentang Rasulullah shallallahu 'alaihi wasallam kecuali satu kejadian dimana dia berkata: Kami pernah bersama Nabi shallallahu 'alaihi wasallam lalu Beliau dipertemukan dengan jama'ah. Kemudian Beliau bersabda: \"Sesungguhnya diantara pohon ada suatu pohon yang \r\nmerupakan perumpamaan bagi seorang muslim\". Aku ingin mengatakan bahwa itu adalah pohon kurma namun karena aku yang termuda maka aku diam. Maka kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Itu adalah pohon kurma\".","created_at":"2017-07-16 21:10:49","updated_at":"2017-07-16 21:10:49"},{"id":49,"id_bab":45,"isi":"Telah menceritakan kepada kami Al Humaidi berkata, telah menceritakan kepada kami Sufyan berkata, telah menceritakan kepadaku Isma'il bin Abu Khalid -dengan lafazh hadits yang lain dari yang dia ceritakan kepada kami dari Az Zuhri- berkata; aku mendengar Qais bin Abu Hazim berkata; aku mendengar Abdullah bin Mas'ud berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak boleh mendengki kecuali terhadap dua hal; (terhadap) seorang yang Allah berikan harta lalu dia pergunakan harta tersebut di jalan kebenaran dan seseorang yang Allah berikan hikmah lalu dia mengamalkan dan mengajarkannya kepada orang lain\".","created_at":"2017-07-16 21:11:11","updated_at":"2017-07-16 21:11:11"},{"id":50,"id_bab":46,"isi":"Telah menceritakan kepada kami Isma'il bin Abu Uwais berkata, Telah menceritakan kepadaku Malik dari Ibnu Syihab dari 'Ubaidullah bin Abdullah bin 'Utbah dari Abdullah bin 'Abbas berkata; aku datang dengan menunggang keledai betina, yang saat itu aku hampir menginjak masa baligh, dan Rasulullah sedang shalat di Mina dengan tidak menghadap \r\ndinding. Maka aku lewat di depan sebagian shaf kemudian aku melepas keledai betina itu supaya mencari makan sesukanya. Lalu aku masuk kembali di tengah shaf dan tidak ada orang yang menyalahkanku\".","created_at":"2017-07-16 21:11:37","updated_at":"2017-07-16 21:11:37"},{"id":51,"id_bab":46,"isi":"Telah menceritakan kepadaku Muhammad bin Yusuf berkata, Telah menceritakan kepada kami Abu Mushir berkata, Telah menceritakan kepadaku Muhammad bin Harb Telah menceritakan kepadaku Az Zubaidi dari Az Zuhri dari Mahmud bin Ar Rabbi' berkata: \"Aku mengingat dari Nabi, saat Beliau melumuri air ludah Beliau di wajahku, saat itu aku baru berumur lima tahun\".","created_at":"2017-07-16 21:11:45","updated_at":"2017-07-16 21:11:45"},{"id":52,"id_bab":47,"isi":"Telah menceritakan kepada kami Abu Al Qasim Khalid bin Khali -seorang hakim di Himshi-, dia berkata; telah menceritakan kepada kami Muhammad bin Harb berkata, Telah menceritakan kepada kami Al Auza'i telah mengabarkan kepada kami Az Zuhri dari 'Ubaidullah bin Abdullah bin 'Utbah bin Mas'ud dari Ibnu 'Abbas bahwasanya dia dan Al Hurru bin Qais bin Hishin Al Fazari berdebat tentang sahabat Musa 'Alaihis salam, Ibnu 'Abbas berkata; dia adalah Khidlir 'Alaihis salam. Tiba-tiba lewat Ubay bin Ka'b di depan keduanya, maka Ibnu 'Abbas memanggilnya dan berkata: \"Aku dan temanku ini berdebat tentang sahabat Musa 'Alaihis salam, yang ditanya tentang jalan yang akhirnya mempertemukannya, apakah kamu pernah mendengar Nabi shallallahu 'alaihi wasallam \r\nmenceritakan masalah ini?\" Ubay bin Ka'ab menjawab: Ya, benar, aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika Musa di tengah pembesar Bani Israil, datang seseorang yang bertanya: apakah kamu mengetahui ada orang yang lebih pandai darimu?\" Berkata Musa 'Alaihis salam: \"Tidak\". Maka Allah Ta'ala mewahyukan kepada Musa 'Alaihis salam: \"Ada, yaitu hamba Kami bernama Hidlir.\" Maka Musa 'Alaihis Salam meminta jalan untuk bertemu dengannya. Allah menjadikan ikan bagi Musa sebagai tanda dan dikatakan kepadanya; \"jika kamu kehilangan ikan tersebut kembalilah, nanti kamu akan berjumpa dengannya\". Maka Musa 'Alaihis Salam mengikuti jejak ikan di lautan. Berkatalah murid Musa 'Alaihis salam: \"Tahukah kamu tatkala kita mencari tempat berlindung di batu tadi? Sesungguhnya aku lupa (menceritakan tentang) ikan itu dan tidaklah yang melupakan aku untuk menceritakannya kecuali setan\". Maka Musa 'Alaihis Salam berkata:.\"Itulah (tempat) yang kita cari\". Lalu keduanya kembali, mengikuti jejak mereka semula. Maka akhirnya keduanya bertemu dengan Hidlir 'Alaihis salam.\" Begitulah kisah keduanya sebagaimana Allah ceritakan dalam Kitab-Nya.","created_at":"2017-07-16 21:12:04","updated_at":"2017-07-16 21:12:04"},{"id":53,"id_bab":48,"isi":"Telah menceritakan kepada kami Muhammad bin Al 'Ala` berkata, telah menceritakan kepada kami Hammad bin Usamah dari Buraid bin Abdullah dari Abu Burdah dari Abu Musa dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Perumpamaan petunjuk dan ilmu yang Allah mengutusku dengan membawanya adalah seperti hujan yang lebat yang turun mengenai tanah. Diantara tanah itu ada jenis yang dapat menyerap air sehingga dapat menumbuhkan tumbuh-tumbuhan dan rerumputan yang banyak. Dan di antaranya ada tanah yang keras lalu menahan air (tergenang) sehingga dapat diminum oleh manusia, memberi minum hewan ternak dan untuk menyiram tanaman. Dan yang lain ada permukaan tanah yang berbentuk lembah yang tidak dapat menahan air dan juga tidak dapat menumbuhkan tanaman. perumpamaan itu adalah seperti orang yang faham agama Allah dan dapat memanfa'atkan apa yang aku diutus dengannya, dia mempelajarinya dan mengajarkannya, dan juga perumpamaan orang yang tidak dapat mengangkat derajat dan tidak menerima hidayah Allah dengan apa yang aku diutus dengannya\". Berkata Abu Abdullah; Ishaq berkata: \"Dan diantara jenis tanah itu ada yang berbentuk lembah yang dapat menampung air hingga penuh dan diantaranya ada padang sahara yang datar\".","created_at":"2017-07-16 21:12:24","updated_at":"2017-07-16 21:12:24"},{"id":54,"id_bab":49,"isi":"Telah menceritakan kepada kami 'Imran bin Maisarah berkata, telah menceritakan kepada kami Abdul Warits dari Abu At Tayyah dari Anas bin Malik berkata, telah bersabda Rasul shallallahu 'alaihi wasallam: \"Sesungguhnya diantara tanda-tanda kiamat adalah diangkatnya ilmu dan merebaknya kebodohan dan diminumnya khamer serta praktek perzinahan secara terang-terangan\".","created_at":"2017-07-16 21:12:39","updated_at":"2017-07-16 21:12:39"},{"id":55,"id_bab":49,"isi":"Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepada kami Yahya dari Syu'bah dari Qotadah dari Anas bin Malik berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya diantara tanda-tanda kiamat adalah sedikitnya ilmu dan merebaknya kebodohan, perzinahan secara terang-terangan, jumlah perempuan \r\nyang lebih banyak dan sedikitnya laki-laki, sampai-sampai (perbandingannya) lima puluh perempuan sama dengan hanya satu orang laki-laki.","created_at":"2017-07-16 21:12:47","updated_at":"2017-07-16 21:12:47"},{"id":56,"id_bab":50,"isi":"Telah menceritakan kepada kami Sa'id bin 'Ufair berkata, Telah menceritakan kepadaku Al Laits berkata, Telah menceritakan kepadaku 'Uqail dari Ibnu Syihab dari Hamzah bin Abdullah bin Umar bahwa Ibnu Umar berkata: aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, aku bermimpi diberi segelas susu lalu aku meminumnya hingga aku melihat pemandangan yang bagus keluar dari kuku-kukuku, kemudian aku berikan sisanya kepada sahabat muliaku Umar bin Al Khaththab\". Orangorang bertanya: \"Apa ta'wilnya wahai Rasulullah?\" Beliau menjawab: \"Ilmu\".","created_at":"2017-07-16 21:13:25","updated_at":"2017-07-16 21:13:25"},{"id":57,"id_bab":51,"isi":"Telah menceritakan kepada kami Isma'il berkata, Telah menceritakan kepadaku Malik dari Ibnu Syihab dari 'Isa bin Thalhah bin Ubaidillah dari Abdullah bin 'Amru bin Al 'Ash; bahwa Rasulullah shallallahu 'alaihi wasallam berdiri di Mina pada haji wada' memberi kesempatan kepada manusia untuk bertanya kepada beliau. Lalu datanglah seseorang dan berkata: \"Aku tidak menyadari, ternyata saat aku mencukur rambut aku belum menyembelih.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sembelihlah, tidak apaapa\" Kemudian datang orang lain dan berkata: \"Aku tidak menyadari, ternyata ketika berkurban aku belum melempar (jumrah) \". Nabi shallallahu 'alaihi wasallam bersabda: \"lemparlah dan tidak apa-apa\". Dan tidaklah Nabi shallallahu 'alaihi wasallam ditanya tentang sesuatu perkara sebelum dan sesudahnya kecuali beliau menjawab: \"Lakukanlah dan tidak apa-apa\".","created_at":"2017-07-16 21:13:47","updated_at":"2017-07-16 21:13:47"},{"id":58,"id_bab":52,"isi":"Telah menceritakan kepada kami Musa bin Isma'il berkata, Telah menceritakan kepada kami Wuhaib berkata, telah menceritakan kepada kami Ayyub dari 'Ikrimah dari Ibnu 'Abbas; bahwa Nabi shallallahu 'alaihi wasallam ditanya seseorang tentang haji yang dilakukannya, orang itu bertanya: \"Aku menyembelih hewan sebelum aku melempar jumrah\". Beliau memberi isyarat dengan tangannya, yang maksudnya \"tidak apa-apa\".\"Dan aku mencukur sebelum menyembelih\". Beliau memberi isyarat dengan tangannya yang maksudnya \"tidak apa-apa\".","created_at":"2017-07-16 21:14:02","updated_at":"2017-07-16 21:14:02"},{"id":59,"id_bab":52,"isi":"Telah menceritakan kepada kami Al Makki bin Ibrahim berkata, telah mengabarkan kepada kami Hanzhalah bin Abu Sufyan dari Salim berkata; aku mendengar Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ilmu akan diangkat dan akan tersebar kebodohan dan fitnah merajalela serta banyak timbul kekacauan\". Ditanyakan kepada Beliau shallallahu 'alaihi wasallam: \"Wahai Rasulullah, apa yang dimaksud dengan kekacauan?\" Maka Rasul shallallahu 'alaihi wasallam menjawab: \"Begini\". Nabi shallallahu 'alaihi wasallam memberi isyarat dengan tangannya lalu memiringkannya. Seakan yang dimaksudnya adalah pembunuhan.","created_at":"2017-07-16 21:14:10","updated_at":"2017-07-16 21:14:10"},{"id":60,"id_bab":52,"isi":"Telah menceritakan kepada kami Musa bin Isma'il berkata, Telah menceritakan kepada kami Wuhaib berkata, Telah menceritakan kepada kami Hisyam dari Fatimah dari Asma' berkata: Aku menemui Aisyah saat dia sedang shalat. Setelah itu aku tanyakan kepadanya: \"Apa yang sedang dilakukan orang-orang?\" Aisyah memberi isyarat ke langit. Ternyata orang-orang sedang melaksanakan shalat (gerhana matahari). Maka Aisyah berkata: \"Maha suci Allah\". Aku tanyakan lagi: \"Satu tanda saja?\" Lalu dia memberi isyarat dengan kepalanya, maksudnya mengangguk tanda mengiyakan. Maka akupun ikut shalat namun timbul perasaan yang membingungkanku, hingga aku siram kepalaku dengan air. Dalam khutbahnya, Nabi shallallahu 'alaihi wasallam memuji Allah dan mensucikan-Nya, lalu bersabda: \"Tidak ada sesuatu yang belum diperlihatkan kepadaku, kecuali aku sudah melihatnya dari tempatku ini hingga surga dan neraka, lalu diwahyukan kepadaku: bahwa kalian akan terkena fitnah dalam kubur kalian seperti -atau hampir berupa- fitnah -yang aku sendiri tidak tahu apa yang diucapkan Asma' diantaranya adalah fitnah Al Masihud dajjal-; \"akan ditanyakan kepada seseorang (didalam kuburnya); \"Apa yang kamu ketahui tentang laki-laki ini?\" Adapun orang beriman atau orang yang yakin, -Asma' kurang pasti mana yang dimaksud diantara keduanya- akan menjawab: 'Dia adalah Muhammad Rasulullah telah datang kepada kami membawa penjelasan dan petunjuk. Maka kami sambut dan kami ikuti. Dia adalah Muhammad, ' diucapkannya tiga kali. Maka kepada orang itu dikatakan: 'Tidurlah dengan tenang, sungguh kami telah mengetahui bahwa kamu adalah orang yang yakin'. Adapun orang Munafiq atau orang yang ragu, -Asma' kurang pasti mana yang dimaksud \r\ndiantara keduanya-, akan menjawab; \"aku tidak tahu siapa dia, aku mendengar manusia membicarakan sesuatu maka akupun mengatakannya\".","created_at":"2017-07-16 21:14:23","updated_at":"2017-07-16 21:14:23"},{"id":61,"id_bab":53,"isi":"Telah menceritakan kepada kami Muhammad bin Muqotil Abu Al Hasan berkata, telah mengabarkan kepada kami Abdullah berkata, telah mengabarkan kepada kami Umar bin Sa'id bin Abu Husain berkata, telah menceritakan kepadaku Abdullah bin Abu Mulaikah dari 'Uqbah bin Al Harits; bahwasanya dia menikahi seorang perempuan putri Ibnu Ihab bin 'Aziz. Lalu datanglah seorang perempuan dan berkata: \"Aku pernah menyusui 'Uqbah dan wanita yang dinikahinya itu\". Maka 'Uqbah berkata kepada perempuan itu: \"Aku tidak tahu kalau kamu pernah menyusuiku dan kamu tidak memberitahu aku.\" Maka 'Uqbah mengendarai kendaraannya menemui Rasul shallallahu 'alaihi wasallam di Madinah dan menyampaikan masalahnya. Maka Rasul shallallahu 'alaihi wasallam bersabda: \"harus bagaimana lagi, sedangkan dia sudah mengatakannya\". Maka 'Uqbah menceraikannya dan menikah dengan wanita yang lain.","created_at":"2017-07-16 21:14:47","updated_at":"2017-07-16 21:14:47"},{"id":62,"id_bab":54,"isi":"Telah menceritakan kepada kami Abu Al Yaman telah mengabarkan kepada kami Syu'aib dari Az Zuhri. Menurut jalur yang lainnya; Abu Abdullah berkata; dan berkata Ibnu Wahb; telah mengabarkan kepada kami Yunus dari Ibnu Syihab dari 'Ubaidullah bin Abdullah bin Abu Tsaur dari Abdullah bin 'Abbas dari Umar berkata: Aku dan tetanggaku dari Anshar berada di desa Banu Umayyah bin Zaid dia termasuk orang kepercayaan di Madinah, kami \r\nsaling bergantian menimba ilmu dari Rasul shallallahu 'alaihi wasallam, sehari aku yang menemui Beliau shallallahu 'alaihi wasallam dan hari lain dia yang menemui Beliau shallallahu 'alaihi wasallam, Jika giliranku tiba, aku menanyakan seputar wahyu yang turun hari itu dan perkara lainnya. Dan jika giliran tetanggaku tiba, ia pun melakukan hal yang sama. Ketika hari giliran tetanggaku tiba, dia datang kepadaku dengan mengetuk pintuku dengan sangat keras, seraya berkata: \"Apakah dia ada disana?\" Maka aku kaget dan keluar menemuinya. Dia berkata: \"Telah terjadi persoalan yang gawat!\". Umar berkata: \"Aku pergi menemui Hafshah, dan ternyata dia sedang menangis, aku bertanya kepadanya: \"Apakah Rasul shallallahu 'alaihi wasallam menceraikanmu?\" Hafshah menjawab: \"Aku tidak tahu\". Maka aku menemui Nabi shallallahu 'alaihi wasallam, sambil berdiri aku tanyakan: \"Apakah engkau menceraikan istri-istri engkau?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Tidak\". Maka aku ucapkan: \"Allah Maha Besar\".","created_at":"2017-07-16 21:15:03","updated_at":"2017-07-16 21:15:03"},{"id":63,"id_bab":55,"isi":"Telah menceritakan kepada kami Muhammad bin Katsir berkata, telah mengabarkan kepada kami Sufyan dari Ibnu Abu Khalid dari Qais bin Abu Hazim dari Abu Al Mas'ud Al Anshari berkata, seorang sahabat bertanya: \"Wahai Rasulullah, aku hampir tidak sanggup shalat yang dipimpin seseorang dengan bacaannya yang panjang.\" Maka aku belum pernah melihat Nabi shallallahu 'alaihi wasallam memberi peringatan dengan lebih marah dari yang disampaikannya hari itu seraya bersabda: \"Wahai manusia, kalian membuat orang lari menjauh. Maka barangsiapa shalat mengimami orang-orang ringankanlah. Karena diantara mereka ada orang sakit, orang lemah dan orang yang punya keperluan\".","created_at":"2017-07-16 21:15:17","updated_at":"2017-07-16 21:15:17"},{"id":64,"id_bab":55,"isi":"Telah menceritakan kepada kami Abdullah bin Muhammad berkata, Telah menceritakan kepada kami Abdul Malik bin 'Amru Al 'Aqadi berkata, Telah menceritakan kepada kami Sulaiman bin Bilal Al Madini dari Rabi'ah bin Abu Abdurrahman dari Yazid mantan budak Al \r\nMunba'its, dari Zaid bin Khalid Al Juhani bahwa Nabi shallallahu 'alaihi wasallam ditanya oleh seseorang tentang barang temuan, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Kenalilah tali pengikatnya, atau Beliau berkata; kantong dan tutupnya, kemudian umumkan selama satu tahun, setelah itu pergunakanlah. Jika datang pemiliknya maka berikanlah kepadanya\". Orang itu bertanya: \"Bagaimana dengan orang yang menemukan unta?\" Maka Nabi shallallahu 'alaihi wasallam marah hingga nampak merah mukanya, lalu berkata: \"apa urusanmu dengan unta itu, sedang dia selalu membawa air di perutnya, bersepatu sehingga dapat hilir mudik mencari minum dan makan rerumputan, maka biarkanlah dia hingga pemiliknya datang mengambilnya\". Orang itu bertanya lagi tentang menemukan kambing, maka Beliau menjawab: \"Itu untuk kamu atau saudaramu atau serigala\".","created_at":"2017-07-16 21:15:27","updated_at":"2017-07-16 21:15:27"},{"id":65,"id_bab":55,"isi":"Telah menceritakan kepada kami Muhammad bin Al 'Ala` berkata, Telah menceritakan kepada kami Abu Usamah dari Buraid dari Abu Burdah dari Abu Musa berkata; Nabi shallallahu 'alaihi wasallam pernah ditanya tentang sesuatu yang Beliau tidak suka, ketika terus ditanya, Beliau marah lalu berkata kepada orang-orang: \"Bertanyalah kepadaku sesuka kalian\". Maka seseorang bertanya: \"Siapakah bapakku?\" Beliau shallallahu 'alaihi wasallam menjawab: \"Bapakmu adalah Hudzafah\". Yang lain bertanya: \"Siapakah bapakku wahai Rasulullah shallallahu 'alaihi wasallam?: \"Bapakmu Salim, sahaya Syaibah\" Ketika Umar melihat apa yang ada pada wajah Beliau, dia berkata: \"Wahai Rasulullah, kami bertaubat kepada Allah 'azza wajalla\".","created_at":"2017-07-16 21:15:34","updated_at":"2017-07-16 21:15:34"},{"id":66,"id_bab":56,"isi":"Telah menceritakan kepada kami Abdah berkata, Telah menceritakan kepada kami Abdushshamad berkata, Telah menceritakan kepada kami Abdullah bin Al Mutsanna berkata; Tsumamah bin Abdullah telah menceritakan kepada kami dari Anas dari Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam apabila memberi salam, diucapkannya tiga kali dan bila berbicara dengan satu kalimat diulangnya tiga kali.","created_at":"2017-07-16 21:15:58","updated_at":"2017-07-16 21:15:58"},{"id":67,"id_bab":56,"isi":"Telah menceritakan kepada kami 'Abdah bin Abdullah Ash Shafar Telah menceritakan kepada kami Abdushshamad berkata, Telah menceritakan kepada kami Abdullah bin Al Mutsanna berkata; Tsumamah bin Abdullah telah menceritakan kepada kami dari Anas dari Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam bila berbicara diulangnya tiga kali hingga dapat dipahami dan bila mendatangi kaum, Beliau memberi salam tiga kali.","created_at":"2017-07-16 21:16:06","updated_at":"2017-07-16 21:16:06"},{"id":68,"id_bab":56,"isi":"Telah menceritakan kepada kami Musaddad berkata, Telah menceritakan kepada kami Abu 'Awanah dari Abu Bisyir dari Yusuf bin Mahak dari Abdullah bin 'Amru berkata, Nabi shallallahu 'alaihi wasallam pernah tertinggal dari kami dalam suatu perjalanan yang kami lakukan, hingga Beliau mendapatkan kami sementara waktu shalat sudah hampir habis, maka kami berwudlu' dengan hanya mengusap kaki kami. Maka Nabi shallallahu 'alaihi wasallam berseru dengan suara yang keras: \"celakalah bagi tumit-tumit yang tidak basah akan masuk neraka.\" Diserukannya hingga dua atau tiga kali.","created_at":"2017-07-16 21:16:13","updated_at":"2017-07-16 21:16:13"},{"id":69,"id_bab":57,"isi":"Telah menceritakan kepada kami Sulaiman bin Harb berkata, Telah menceritakan kepada kami Syu'bah dari Ayyub berkata; aku mendengar 'Atho' berkata; aku mendengar Ibnu 'Abbas berkata: aku menyaksikan bahwa Nabi shallallahu 'alaihi wasallam -sedang menurut 'Atho', dia berkata; aku menyaksikan Ibnu 'Abbas berkata; - bahwa Nabi shallallahu 'alaihi wasallam keluar bersama Bilal, -dan dia mengira bahwa dia tidak mendengar, - maka Nabi memberi pelajaran kepada para wanita dan memerintahkan untuk bersedekah, maka seorang wanita memberikan anting dan cincin emasnya, dan Bilal memasukkannya ke saku bajunya. Berkata Abu Abdullah; dan Isma'il berkata; dari Ayyub dari 'Atho', dan dia berkata; dari Ibnu 'Abbas bahwa ia bersaksi terhadap Rasulullah shallallahu 'alaihi wasallam","created_at":"2017-07-16 21:16:38","updated_at":"2017-07-16 21:16:38"},{"id":70,"id_bab":58,"isi":"Telah menceritakan kepada kami Abdul 'Aziz bin Abdullah berkata, telah menceritakan kepadaku Sulaiman dari 'Amru bin Abu 'Amru dari Sa'id Al Maqburi dari Abu Hurairah, bahwa dia berkata: ditanyakan (kepada Rasulullah shallallahu 'alaihi wasallam: \"Wahai Rasulullah siapakah orang yang paling berbahagia dengan syafa'atmu pada hari kiamat?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Aku telah menduga wahai Abu Hurairah, bahwa tidak ada orang yang mendahuluimu dalam menanyakan masalah ini, karena aku lihat betapa perhatian dirimu terhadap hadits. Orang yang paling berbahagia dengan syafa'atku pada hari kiamat adalah orang yang mengucapkan Laa ilaaha illallah dengan ikhlas dari hatinya atau jiwanya\".","created_at":"2017-07-16 21:16:53","updated_at":"2017-07-16 21:16:53"},{"id":71,"id_bab":59,"isi":"Telah menceritakan kepada kami Isma'il bin Abu Uwais berkata, telah menceritakan kepadaku Malik dari Hisyam bin 'Urwah dari bapaknya dari Abdullah bin 'Amru bin Al 'Ash berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah tidaklah mencabut ilmu sekaligus mencabutnya dari hamba, akan tetapi Allah mencabut ilmu dengan cara mewafatkan para ulama hingga bila sudah tidak tersisa ulama maka manusia akan mengangkat pemimpin dari kalangan orang-orang bodoh, ketika mereka ditanya mereka berfatwa tanpa ilmu, mereka sesat dan menyesatkan\". Berkata Al Firabri Telah menceritakan kepada kami 'Abbas berkata, Telah menceritakan kepada kami Qutaibah Telah menceritakan kepada kami Jarir dari Hisyam seperti ini juga.","created_at":"2017-07-16 21:17:11","updated_at":"2017-07-16 21:17:11"},{"id":72,"id_bab":60,"isi":"Telah menceritakan kepada kami Adam berkata, Telah menceritakan kepada kami Syu'bah berkata, telah menceritakan kepadaKu Ibnu Al Ashbahani berkata; aku mendengar Abu Shalih Dzakwan menceritakan dari Abu Sa'id Al Khudri; kaum wanita berkata kepada Nabi shallallahu 'alaihi wasallam: \"kaum lelaki telah mengalahkan kami untuk bertemu dengan engkau, maka berilah kami satu hari untuk bermajelis dengan diri tuan\" Maka Nabi shallallahu 'alaihi wasallam berjanji kepada mereka satu untuk bertemu mereka, lalu Nabi shallallahu 'alaihi wasallam memberi pelajaran dan memerintahkan kepada mereka, diantara yang disampaikannya adalah: \"Tidak seorangpun dari kalian yang didahului oleh tiga orang dari anaknya kecuali akan menjadi tabir bagi dirinya dari neraka\". Berkata seseorang: \"bagaimana kalau dua orang?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Juga dua\". Telah menceritakan kepada kami Muhammad bin Basysyar berkata, Telah menceritakan kepada kami Ghundar berkata, Telah menceritakan kepada kami Syu'bah dari Abdurrahman Al Ashbahani dari Dzakwan dari Abu Sa'id Al Khudri dari Nabi shallallahu 'alaihi wasallam. Dan dengan sanad seperti ini dari Abdurrahman Al Ashbahani berkata; aku mendengar Abu Hazm dari Abu Hurairah berkata: \"Tiga orang yang belum baligh\".","created_at":"2017-07-16 21:17:32","updated_at":"2017-07-16 21:17:32"},{"id":75,"id_bab":66,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Hisyam bin 'Urwah dari Bapaknya dari 'Aisyah isteri Nabi shallallahu 'alaihi wasallam, bahwa jika Nabi shallallahu 'alaihi wasallam mandi karena janabat, beliau memulainya dengan mencuci kedua telapak tangannya, kemudian berwudlu sebagaimana wudlu untuk shalat, kemudian memasukkan jari-jarinya ke dalam air lalu menggosokkannya ke kulit kepalanya, kemudian menyiramkan air ke atas kepalanya dengan cidukan kedua telapak tangannya sebanyak tiga kali, kemudian beliau mengalirkan air ke seluruh kulitnya.\"","created_at":"2017-07-17 03:34:35","updated_at":"2017-07-17 03:34:35"},{"id":76,"id_bab":66,"isi":"Telah menceritakan kepada kami Muhammad bin Yusuf berkata, telah menceritakan kepada kami Sufyan dari Al A'masy dari Salim bin Abu Al Ja'd dari Kuraib dari Ibnu 'Abbas dari Maimunah isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Nabi shallallahu 'alaihi wasallam berwudlu sebagaimana wudlunya untuk shalat, kecuali kedua kakinya. Beliau lalu mencuci kemaluan dan apa yang terkena kotoran (mani), kemudian menyiramkan air ke atasnya, kemudian mengakhirinya dengan menyela dan mencuci kedua kakinya. Itulah cara beliau mandi dari janabat.\"","created_at":"2017-07-17 03:34:48","updated_at":"2017-07-17 03:34:48"},{"id":77,"id_bab":67,"isi":"Telah menceritakan kepada kami Adam bin Abu Iyas berkata, telah menceritakan kepada kami Ibnu Abu Dzi'b dari Az Zuhri dari 'Urwah dari 'Aisyah berkata, \"Aku pernah mandi bersama Nabi shallallahu 'alaihi wasallam dari satu ember terbuat dari tembikar yang disebut Al Faraq.\"","created_at":"2017-07-17 03:35:08","updated_at":"2017-07-17 03:35:08"},{"id":78,"id_bab":68,"isi":"Telah menceritakan kepada kami 'Abdullah bin Muhammad berkata, telah menceritakan kepadaku 'Abdush Shamad berkata, telah menceritakan kepadaku Syu'bah berkata, telah menceritakan kepadaku Abu Bakar bin Hafsh berkata, aku mendengar Abu Salamah berkata, \"Aku dan saudara 'Aisyah menemui 'Aisyah, lalu saudaranya bertanya kepadanya tentang cara Nabi shallallahu 'alaihi wasallam mandi (dari janabat). 'Aisyah lalu minta diambilkan satu bejana air setara dengan ukuran satu sha'. Kemudian mandi dan menuangkan air ke atas kepalanya, sementara antara kami dengannya terhalang oleh hijab.\" Abu 'Abdullah berkata, Yazid bin Harun dan Bahz dan Al Juddi menyebutkan dari Syu'bah, \"Sekadar satu sha'.\"","created_at":"2017-07-17 03:35:38","updated_at":"2017-07-17 03:35:38"},{"id":79,"id_bab":68,"isi":"Telah menceritakan kepada kami 'Abdullah bin Muhammad berkata, telah menceritakan kepada kami Yahya bin Adam berkata, telah menceritakan kepada kami Zuhair dari Abu Ishaq berkata, telah menceritakan kepada kami Abu Ja'far bahwasanya ia berada di sisi Jabir bin 'Abdullah -dia dan ayahnya (Ali bin Al Hasan) -, dan di dekat Jabir juga ada sekelompok orang yang bertanya kepadanya tentang cara mandi. Jabir bin Abdullah lalu menjawab, \"Cukup bagimu dengan satu sha' air.\" Tiba-tiba ada seorang yang berkata, \"Bagiku tidak cukup!\" Maka Jabir pun berkata, \"Seukuran itu cukup buat orang yang lebih lebat rambutnya darimu, dan yang lebih baik darimu.\"","created_at":"2017-07-17 03:35:47","updated_at":"2017-07-17 03:35:47"},{"id":80,"id_bab":68,"isi":"Telah menceritakan kepada kami Abu Nu'aim berkata, telah menceritakan kepada kami Ibnu 'Uyainah dari 'Amru dari Jabir bin Zaid dari Ibnu 'Abbas, bahwa Nabi shallallahu 'alaihi wasallam dan Maimunah mandi bersama dari satu ember.\" Abu 'Abdullah berkata, \"Terakhir Ibnu 'Uyainah meriwayatkan dari Ibnu Abbas dari Maimunah, padahal yang benar adalah apa yang diriwayatkan oleh Abu Nu'aim.\"","created_at":"2017-07-17 03:35:54","updated_at":"2017-07-17 03:35:54"},{"id":81,"id_bab":69,"isi":"Telah menceritakan kepada kami Abu Nu'aim berkata, telah menceritakan kepada kami Zuhair dari Abu Ishaq berkata, telah menceritakan kepadaku Sulaiman bin Shurad berkata, telah menceritakan kepadaku Jubair bin Muth'im berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku menyiram kepalaku sebanyak tiga kali.\" Beliau memberi isyarat dengan kedua telapak tangannya.","created_at":"2017-07-17 03:36:14","updated_at":"2017-07-17 03:36:14"},{"id":82,"id_bab":69,"isi":"Telah menceritakan kepada kami Muhammad bin Basyar berkata, telah menceritakan kepada kami Ghundar berkata, telah menceritakan kepada kami Syu'bah dari Mikhwal bin Rasyid dari Muhammad bin 'Ali dari Jabir bin 'Abdullah berkata, \"Nabi shallallahu 'alaihi wasallam menguyurkan air ke atas kepala sebanyak tiga kali.\"","created_at":"2017-07-17 03:36:22","updated_at":"2017-07-17 03:36:22"},{"id":83,"id_bab":69,"isi":"Telah menceritakan kepada kami Abu Nu'aim berkata, telah menceritakan kepada kami Ma'mar bin Yahya bin Sam telah menceritakan kepadaku Abu Ja'far berkata, Jabir bin 'Abdullah berkata kepadaku, \"Anak pamanmu telah datang kepadaku -mengisahkan Hasan bin Muhammad bin Al Hanafiah-, ia bertanya, \"Bagaimana cara mandi janabat? Aku menjawab, \"Nabi shallallahu 'alaihi wasallam mengambil air dengan tiga ciduk telapak tangannya lalu menyiramkannya ke atas kepalanya, kemudian menyiramkan ke seluruh tubuh.\" Al Hasan lalu berkata kepadaku, \"Aku adalah seorang laki-laki yang rambutnya lebat!\" Aku lalu menjawab, \"Nabi shallallahu 'alaihi wasallam rambutnya lebih lebah dari rambutmu.\"","created_at":"2017-07-17 03:36:34","updated_at":"2017-07-17 03:36:34"},{"id":84,"id_bab":70,"isi":"Telah menceritakan kepada kami Musa bin Isma'il berkata, telah menceritakan kepada kami 'Abdul Wahid dari Al A'masy dari Salim bin Abu Al Ja'd dari Kuraib dari Ibnu 'Abbas berkata, Maimunah berkata, \"Aku menyiapkan air mandi untuk Nabi shallallahu 'alaihi wasallam, beliau mencuci kedua telapak tangannya dua atau tiga kali. Kemudian beliau menuangkan air ke telapak tangan kirinya dan membasuh kemaluannya, kemudian beliau usapkan tangannya ke tanah, kemudian berkumur dan memasukkan air ke dalam hidung, lalu membasuh wajah dan kedua tangannya. kemudian beliau mengguyur seluruh tubuhnya. Setelah itu beliau bergeser dari tempatnya semula, lalu mencuci kedua kakinya.\"","created_at":"2017-07-17 03:36:50","updated_at":"2017-07-17 03:36:50"},{"id":85,"id_bab":71,"isi":"Telah menceritakan kepada kami 'Umar bin Hafsh bin Ghiyats berkata, telah menceritakan kepada kami Bapakku telah menceritakan kepada kami Al A'masy berkata, telah menceritakan kepadaku Salim dari Kuraib dari Ibnu 'Abbas berkata, telah menceritakan kepada kami Maimunah berkata, \"Aku menuangkan air untuk mandi Nabi shallallahu 'alaihi wasallam, lalu dengan tangan kanannya beliau menuangkan air pada tangan kirinya lalu membasuh keduanya. Kemudian mencuci kemaluannya, lalu menyentuhkan tangannya ke bumi dan mengusapnya dengan tanah, lalu mencucinya dengan air. Kemudian berkumurkumur dan memasukkan air ke hidung, kemudian membasuh muka dan menyiramkan air ke \r\natas kepalanya. Kemudian beliau bergeser untuk mencuci kedua telapak kakinya. Setelahitu beliau diberi handuk, tapi beliau tidak mengeringkan badannya dengan handuk tersebut.\"","created_at":"2017-07-17 03:37:27","updated_at":"2017-07-17 03:37:27"},{"id":86,"id_bab":72,"isi":"Telah menceritakan kepada kami 'Abdullah bin Maslamah telah mengabarkan kepada kami Aflah bin Humaid dari Al Qasim dari 'Aisyah berkata, \"Aku pernah mandi bersama Nabi shallallahu 'alaihi wasallam dari satu bejana, dan tangan kami saling bersentuhan.\"","created_at":"2017-07-17 03:37:56","updated_at":"2017-07-17 03:37:56"},{"id":87,"id_bab":72,"isi":"Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepada kami Hammad dari Hisyam dari Bapaknya dari 'Aisyah berkata, \"Jika Nabi shallallahu 'alaihi wasallam mandi janabat beliau membasuh tangannya.\"","created_at":"2017-07-17 03:38:04","updated_at":"2017-07-17 03:38:04"},{"id":88,"id_bab":72,"isi":"Telah menceritakan kepada kami Abu Al Walid berkata, telah menceritakan kepada kami Syu'bah dari Abu Bakar bin Hafsh dari 'Urwah dari 'Aisyah berkata, \"Aku pernah mandi junub bersama Nabi shallallahu 'alaihi wasallam dalam satu bejana.\" Dan dari 'Abdurrahman bin Al Qasim dari Bapaknya dari 'Aisyah seperti itu.\"","created_at":"2017-07-17 03:38:11","updated_at":"2017-07-17 03:38:11"},{"id":89,"id_bab":72,"isi":"Telah menceritakan kepada kami Abu Al Walid berkata, telah menceritakan kepada kami Syu'bah dari 'Abdullah bin 'Abdullah bin Jabr berkata, aku mendengar Anas bin Malik berkata, \"Nabi shallallahu 'alaihi wasallam dan salah seorang dari isterinya mandi dalam satu bejana.\" Muslim dan Wahb bin Jarir dari Syu'bah menambahkan, \"Karena junub.\"","created_at":"2017-07-17 03:38:19","updated_at":"2017-07-17 03:38:19"},{"id":90,"id_bab":73,"isi":"Telah menceritakan kepada kami Muhammad bin Mahbub berkata, telah menceritakan kepada kami 'Abdul Wahid berkata, telah menceritakan kepada kami Al A'masy dari Salim bin Abu Al Ja'd dari Kuraib mantan budak Ibnu 'Abbas, dari Ibnu 'Abbas berkata, Maimunah berkata, \"Aku menyediakan air mandi untuk Rasulullah shallallahu 'alaihi wasallam, beliau lalu menuangkan air pada kedua tangannya dan mencuci keduanya dua kali dua kali atau tiga kali. Lalu dengan tangan kanannya beliau menuangkan air pada telapak tangan kirinya lalu mencuci kemaluannya, setelah itu menyentuhkan tangannya ke tanah. Kemudian berkumur-kumur dan memasukkan air ke hidung. Kemudian membasuh muka dan kedua tangannya, lalu membasuh kepalanya tiga kali dan mengguyur seluruh badannya. Setelah itu beliau bergeser dari posisi semula lalu mencuci kedua telapak kakinya.\"","created_at":"2017-07-17 03:39:07","updated_at":"2017-07-17 03:39:07"},{"id":91,"id_bab":74,"isi":"Telah menceritakan kepada kami Abdullah bin Muhammad berkata, telah menceritakan kepada kami 'Utsman bin 'Umar berkata, telah mengabarkan kepada kami Yunus dari Az Zuhry dari Abu Salamah dari Abu Hurairah radliallahu 'anhu berkata,: \"Qamat untuk shalat telah dikumandangkan dan shaf telah diluruskan, lalu keluarlah Rasulullah shallallahu 'alaihi wasallam. Setelah sampai di tempat shalat Beliau baru teringat bahwa Beliau sedang junub, lalu berkata, kepada kami; \"tetaplah di tempat kalian\". Maka Beliau kembali lalu mandi. Kemudian datang dalam keadaan kapalanya basah. Lalu Beliau bertakbir, maka kamipun shalat bersamanya\". Hadits ini juga diriwayatkan oleh Abdul A'laa dari Ma'mar dari Az Zuhry dan diriwayatkan juga oleh Al Auza'i dari Az Zuhry.","created_at":"2017-07-17 03:39:57","updated_at":"2017-07-17 03:39:57"},{"id":92,"id_bab":75,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari 'Abdurrahman bin Al Qasim dari bapaknya dari 'Aisyah isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam dalam salah satu perjalanan yang dilakukannya. Hingga ketika kami sampai di Baida', atau tempat peristirahatan pasukan, aku kehilangan kalungku. Maka Nabi shallallahu 'alaihi wasallam dan para sahabatnya mencarinya sementara mereka tidak berada dekat air. Orang-orang lalu datang kepada Abu Bakar Ash Shidiq seraya berkata, 'Tidakkah kamu perhatikan apa yang telah diperbuat oleh 'Aisyah? Dia telah membuat Rasulullah shallallahu 'alaihi wasallam dan orang-orang tertahan (dari melanjutkan perjalanan) padahal mereka tidak sedang berada dekat air dan mereka juga tidak memiliki air! ' Lalu Abu Bakar datang sedangkan saat itu Rasulullah shallallahu 'alaihi wasallam meletakkan kepalanya di pahaku. Abu Bakar lalu memarahiku dan mengatakan sebagaimana yang dikehendaki Allah untuk (Abu Bakar) mengatakannya. Ia menusuk lambungku, dan tidak ada yang menghalangiku untuk bergerak (karena rasa sakit) kecuali karena keberadaan Rasulullah yang di pahaku.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bangun di waktu subuh dalam keadaan tidak memiliki air. Allah Ta'ala kemudian menurunkan ayat tayamum, maka orang-orang pun bertayamum.\" Usaid bin Al Hudlair lalu berkata, \"Tidaklah Aisyah kecuali awal dari keberkahan keluarga kamu wahai wahai Abu Bakar!\" 'Aisyah berkata, \"Kemudian unta yang aku tunggangi berdiri yang ternyata kami temukan kalungku berada dibawahnya.\"","created_at":"2017-07-17 03:41:34","updated_at":"2017-07-17 03:41:34"},{"id":93,"id_bab":75,"isi":"Telah menceritakan kepada kami Muhammad bin Sinan -yaitu Al 'Awaqi- telah menceritakan kepada kami Husyaim berkata. (dalam jalur lain disebutkan) Telah menceritakan kepadaku Sa'id bin An Nadlr berkata, telah mengabarkan kepada kami Husyaim berkata, telah mengabarkan kepada kami Sayyar berkata, telah menceritakan kepada kami Yazid -yaitu Ibnu Shuhaib Al Faqir- berkata, telah mengabarkan kepada kami Jabir bin 'Abdullah bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Aku diberikan lima perkara yang tidak diberikan kepada orang sebelumku; aku ditolong melawan musuhku dengan ketakutan mereka sejauh satu bulan perjalanan, dijadikan bumi untukku sebagai tempat sujud dan suci. Maka dimana saja salah seorang dari umatku mendapati waktu shalat hendaklah ia shalat, dihalalkan untukku harta rampasan perang yang tidak pernah dihalalkan untuk orang sebelumku, aku diberikan (hak) syafa'at, dan para Nabi sebelumku diutus khusus untuk kaumnya sedangkan aku diutus untuk seluruh manusia.\"","created_at":"2017-07-17 03:41:43","updated_at":"2017-07-17 03:41:43"},{"id":94,"id_bab":76,"isi":"Telah menceritakan kepada kami Zakaria bin Yahya berkata, telah menceritakan kepada kami 'Abdullah bin Numair berkata, telah menceritakan kepada kami Hisyam bin 'Urwah dari Bapaknya dari 'Aisyah bahwa ia meminjam kalung kepada Asma' lalu hilang. Maka Rasulullah shallallahu 'alaihi wasallam mengutus seseorang untuk mencarinya hingga kalung itu pun ditemukan. Lalu datanglah waktu shalat sementara mereka tidak memiliki air, namun mereka tetap melaksanakannya. Setelah itu mereka mengadukan peristiwa itu kepada Rasulullah shallallahu 'alaihi wasallam, hingga turunlah ayat tayamum. Usaid bin Al Hudlair lalu berkata kepada 'Aisyah, \"Semoga Allah membalasmu dengan segala kebaikan. Sungguh demi Allah, tidaklah terjadi suatu peristiwa menimpa anda yang anda tidak sukai kecuali Allah menjadikannya untuk anda dan Kaum Muslimin sebagai kebaikan.\"","created_at":"2017-07-17 03:42:00","updated_at":"2017-07-17 03:42:00"},{"id":95,"id_bab":77,"isi":"Telah menceritakan kepada kami Hajjaj dia berkata; telah mengabarkan kepada kami Syu'bah telah mengabarkan kepada kami Al Hakam dari Dzarri dari Sa'id bin 'Abdurrahman bin Abza dari bapaknya, telah berkata, pula 'Ammar tentang maslah ini; Maka Syu'bah memukulkan telapak tangannya ke tanah lalu mendekatkannya kepada mulutnya kemudian mengusapkannya ke mukanya dan kedua telapak tangannya. Dan telah berkata An Nadlar telah mengabarkan kepada kami Syu'bah dari Al Hakam dia berkata; saya mendengar Dzarr berkata; dari Ibnu Abdurrahman bin Abzaa, berkata Al Hakam; dan aku telah mendengarnya dari Ibnu Abdurrahman dari ayahnya berkata; Ammar berkata;.","created_at":"2017-07-17 03:42:34","updated_at":"2017-07-17 03:42:34"},{"id":96,"id_bab":77,"isi":"Telah menceritakan kepada kami Sulaiman bin Harb berkata, telah menceritakan kepada kami Syu'bah dari Al Hakam dari Dzar dari Ibnu 'Abdurrahman bin Abza dari Bapaknya bahwa ia pernah melihat 'Umar saat 'Ammar bertanya kepadanya, \"Kami sedang dalam perjalanan, kemudian kami junub?\" dia menjawab, \"Hendaknya bertayamum.\"","created_at":"2017-07-17 03:42:42","updated_at":"2017-07-17 03:42:42"},{"id":97,"id_bab":77,"isi":"Telah menceritakan kepada kami Muhammad bin Katsir telah mengabarkan kepada kami Syu'bah dari Al Hakam dari Dzar dari Ibnu 'Abdurrahman bin Abza dari 'Abdurrahman bin Abza ia berkata; Ammar berkata kepada Umar, \"Aku bergulingan (di atas pasir) lalu menemui Nabi shallallahu 'alaihi wasallam. Maka beliau pun bersabda: \"Cukup bagimu (mengusap debu) pada muka dan kedua telapak tangan.\" Telah menceritakan kepada kami Muslim telah menceritakan kepada kami Syu'bah dari Al Hakam dari Dzar dari Ibnu 'Abdurrahman dari 'Abdurrahman bin Abza ia berkata, \"Aku melihat Umar ketika Ammar bertanya kepadanya….lalu ia menyebutkan hadits.\"","created_at":"2017-07-17 03:42:48","updated_at":"2017-07-17 03:42:48"},{"id":98,"id_bab":77,"isi":"Telah menceritakan kepada kami Muhammad bin Basysyar ia berkata; telah menceritakan kepada kami Ghundar telah menceritakan kepada kami Syu'bah dari Al Hakam dari Dzarr dari Ibnu 'Abdurrahman bin Abza dari Bapaknya ia berkata, \" Ammar berkata, \"Nabi shallallahu 'alaihi wasallam memukulkan telapak tangannya ke tanah lalu mengusapkan pada muka dan kedua telapak tangannya.\"","created_at":"2017-07-17 03:42:57","updated_at":"2017-07-17 03:42:57"},{"id":99,"id_bab":78,"isi":"Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepadaku Yahya bin Sa'id berkata, telah menceritakan kepada kami 'Auf berkata, telah menceritakan kepada kami Abu Raja' dari 'Imran berkata, \"Kami pernah dalam suatu perjalanan bersama Nabi shallallahu 'alaihi wasallam, kami berjalan di waktu malam hingga ketika sampai di akhir malam kami tidur, dan tidak ada tidur yang paling enak (nyenyak) bagi musafir melebihi yang kami alami. Hingga tidak ada yang membangunkan kami kecuali panas sinar matahari. Dan orang yang pertama kali bangun adalah si fulan, lalu si fulan, lalu seseorang yang Abu 'Auf mengenalnya namun akhirnya lupa. Dan 'Umar bin Al Khaththab adalah orang keempat saat bangun, Sedangkan Nabi shallallahu 'alaihi wasallam bila tidur tidak ada yang membangunkannya hingga beliau bangun sendiri, karena kami tidak tahu apa yang terjadi pada beliau dalam tidurnya. Ketika 'Umar bangun dan melihat apa yang terjadi di tengah banyak orang (yang kesiangan) -dan 'Umar adalah seorang yang tegar penuh keshabaran-, maka ia bertakbir dengan mengeraskan suaranya dan terus saja bertakbir dengan keras hingga Nabi shallallahu 'alaihi wasallam terbangun akibat kerasnya suara takbir 'Umar. Tatkala beliau bangun, orang-orang mengadukan peristiwa yang mereka alami. Maka beliau bersabda: \"Tidak masalah, atau tidak apa dan lanjutkanlah perjalanan.\" Maka beliau meneruskan perjalanan dan setelah beberapa jarak yang tidak jauh beliau berhenti lalu meminta segayung air untuk wudlu, beliau lalu berwudlu kemudian menyeru untuk shalat. Maka beliau shalat bersama orang banyak. Setelah beliau selesai melaksanakan shalatnya, didapatinya ada seorang yang memisahkan diri tidak ikut shalat bersama orang banyak. Maka Nabi shallallahu 'alaihi wasallam bertanya: \"Wahai Fulan, apa yang menghalangimu untuk shalat bersama orang banyak?\" Orang itu menjawab, \"Aku lagi junub, sementara air tidak ada.\" Beliau lantas menjelaskan: \"Kamu cukup menggunakan debu.\" Kemudian Nabi \r\nshallallahu 'alaihi wasallam melanjutkan perjalanan hingga akhirnya orang-orang mengadu kepada beliau bahwa mereka kehausan. Maka Nabi shallallahu 'alaihi wasallam meminta seseorang yang bernama Abu Raja' -namun 'Auf lupa- dan 'Ali seraya memerintahkan keduanya: \"Pergilah kalian berdua dan carilah air.\" Maka keduanya berangkat hingga berjumpa dengan seorang wanita yang membawa kantung-kantung berisi air dengan untanya. Maka keduanya bertanya kepadanya, \"Dimana ada air?\" Wanita itu menjawab, \"Terakhir aku lihat air di (daerah) ini adalah waktu sekarang ini. dan perjalanan kami ini juga dalam rangka mencari air.\" Lalu keduanya berkata, \"Kalau begitu pergilah\". Wanita itu bertanya, \"Kalian mau kemana?\" Keduanya menjawab, \"Menemui Rasulullah shallallahu 'alaihi wasallam.\" Wanita itu bertanya, \"Kepada orang yang dianggap telah keluar dari agama (Shabi'i)?\" Keduanya menjawab, \"Ya dialah yang kamu maksud.\" Kemudian kedua sahabat Nabi itu pergi bersama wanita tersebut menemui Nabi shallallahu 'alaihi wasallam. Keduanya kemudian menceritakan peritiwa yang baru saja dialami. Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Turunkanlah dia dari untanya.\" Kemudian Nabi shallallahu 'alaihi wasallam meminta bejana air, beliau lalu menuangkan di mulut kantung-kantung air (milik wanita itu), beliau lepas ikatan kantung-kantung air tersebut seraya berseru kepada orang banyak: \"Ambillah air dan minumlah sesuka kalian!\" Maka orang-orang memberi minum (tunggangan mereka) dan meminum sesuka mereka. Dan akhir, beliau memberi seember air kepada orang yang tadi terkena janabah. Beliau lalu berkata kepadanya: \"Pergi dan mandilah.\" Dans ambil berdiri wanita tersebut mengamati apa yang diperbuat terhadap air kepunyaannya. Demi Allah, kejadian tadi telah membuatnya terperanjat dan juga kami, kami saksikan airnya bertambah banyak dibanding saat yang pertama. Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Berkumpulkan (makanan) untuknya.\" Maka orang-orang pun mengumpulkan makanan berupa kurma, tepung, sawiq (campuran antara susu dengan tepung) untuk wanita tersebut. makanan tersebut kemudian dimasukkan ke dalam kain, mereka menaikkan wanita tersebut di atas kendaraan dan meletakkan makanan tersebut di depannya. Kemudian Nabi shallallahu 'alaihi wasallam berkata kepada wanita tersebut: \"Kamu mengetahui bahwa kami tidak mengurangi sedikitpun air milikmu, tetapi Allah yang telah memberi minum kepada kami.\" Wanita tersebut kemudian pulang menemui keluarganya, mereka lalu bertanya, \"Wahai fulanah, apa yang membuat kamu terlambat?\" Wanita tersebut menjawab, \"Suatu keajaiban! Aku bertemu dengan dua orang laki-laki yang kemudian membawaku bertemu dengan seorang yang disebut Shabi'I, lalu laki-laki itu berbuat begini begini. Demi Allah, dialah orang yang paling menakjubkan (membuat kejadian luar biasa) di antara yang ada ini dan ini.\" Wanita tersebut berkata sambil memberi isyarat dengan mengangkat jari tengah dan telunjuknya ke arah langit, atau antara langit dan bumi. Maksudnya bersaksi bahwa dia adalah Utusan Allah yang haq. Sejak saat itu Kaum Muslimin selalu melindungi wanita tersebut dari Kaum Musyrikin dan tidaklah Kaum Muslimin merusak rumah atau kediaman wanita tersebut. Pada suatu hari wanita itu berkata kepada kaumnya, \"Aku tidak memandang bahwa kaum tersebut membiarkan kalian dengan sengaja. Apakah kalian mau masuk Islam?\" Maka kaumnya mentaatinya dan masuk ke dalam Islam.\" Abu 'Abdullah berkata, \"Yang dimaksud dengan Shabi'i adalah keluar dari suatu agama kepada agama lain.\" Sedangkan Abu' 'Aliyah berkata, \"Ash-Shabi'un adalah kelompok dari Ahlul Kitab yang membaca Kitab Zabur.\"","created_at":"2017-07-17 03:43:23","updated_at":"2017-07-17 03:43:23"},{"id":100,"id_bab":79,"isi":"Telah menceritakan kepada kami Yahya bin Bukair berkata, telah menceritakan kepada kami Al Laits dari Yunus dari Ibnu Syihab dari Anas bin Malik berkata, Abu Dzar menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saat aku di Makkah atap rumahku terbuka, tiba-tiba datang Malaikat Jibril Alaihis Salam. Lalu dia membelah dadaku kemudian mencucinya dengan menggunakan air zamzam. Dibawanya pula bejana terbuat dari emas berisi hikmah dan iman, lalu dituangnya ke dalam dadaku dan menutupnya kembali. Lalu dia memegang tanganku dan membawaku menuju langit dunia. Tatkala aku sudah sampai di langit dunia, Jibril Alaihis Salam berkata kepada Malaikat penjaga langit, 'Bukalah'. Malaikat penjaga langit berkata, 'Siapa Ini? ' Jibril menjawab, 'Ini Jibril'. Malaikat penjaga langit bertanya lagi, 'Apakah kamu bersama orang lain? ' Jibril menjawab, \"Ya, bersamaku Muhammad shallallahu 'alaihi wasallam.' Penjaga itu bertanya lagi, 'Apakah dia diutus sebagai Rasul? ' Jibril menjawab, 'Benar.' Ketika dibuka dan kami sampai di langit dunia, ketika itu ada seseorang yang sedang duduk, di sebelah kanan orang itu ada sekelompok manusia begitu juga di sebelah kirinya. Apabila dia melihat kepada sekelompok orang yang di sebelah kanannya ia tertawa, dan bila melihat ke kirinya ia menangis. Lalu orang itu berkata, 'Selamat datang Nabi yang shalih dan anak yang shalih.' Aku bertanya kepada Jibril, 'Siapakah dia? ' Jibril menjawab, \"Dialah Adam Alaihis Salam, dan orang-orang yang ada di sebelah kanan dan kirinya adalah ruh-ruh anak keturunannya. Mereka yang ada di sebelah kanannya adalah para ahli surga sedangkan yang di sebelah kirinya adalah ahli neraka. Jika dia memandang ke sebelah kanannya dia tertawa dan bila memandang ke sebelah kirinya dia menangis.' Kemudian aku dibawa menuju ke langit kedua, Jibril lalu berkata kepada penjaganya seperti terhadap penjaga langit pertama. Maka langit pun dibuka'.\" Anas berkata, \"Kemudian Nabi shallallahu 'alaihi wasallam menyebutkan bahwa pada tingkatan langit-langit itu beliau bertemu dengan Adam, Idris, Musa, 'Isa dan Ibrahim semoga Allah memberi shalawat-Nya kepada mereka. Beliau tidak menceritakan kepadaku keberadaan mereka di langit tersebut, kecuali bahwa beliau bertemu Adam di langit dunia dan Ibrahim di langit keenam.\" Anas melanjutkan, \"Ketika Jibril berjalan bersama Nabi shallallahu 'alaihi wasallam, ia melewati Idris. Maka Idris pun berkata, 'Selamat datang Nabi yang shalih dan saudara yang shalih.' Aku bertanya kepada Jibril, 'Siapakah dia? ' Jibril menjawab, 'Dialah Idris.' Lalu aku berjalan melewati Musa, ia pun berkata, 'Selamat datang Nabi yang shalih dan saudara yang shalih.' Aku bertanya kepada Jibril, 'Siapakah dia? ' Jibril menjawab, 'Dialah Musa.' Kemudian aku berjalan melewati 'Isa, dan ia pun berkata, 'Selamat datang saudara yang shalih dan Nabi yang shalih.' Aku bertanya kepada Jibril, 'Siapakah dia? ' Jibril menjawab, 'Dialah 'Isa.' Kemudian aku melewati Ibrahim dan ia pun berkata, 'Selamat datang Nabi yang shalih dan anak yang shalih.' Aku bertanya kepada Jibril, 'Siapakah dia? ' Jibril menjawab, 'Dialah Ibrahim shallallahu 'alaihi wasallam.' Ibnu Syihab berkata, Ibnu Hazm mengabarkan kepadaku bahwa Ibnu 'Abbas dan Abu Habbah Al Anshari keduanya berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Kemudian aku dimi'rajkan hingga sampai ke suatu tempat yang aku dapat mendengar suara pena yang menulis.\" Ibnu Hazm berkata, \r\n\"Anas bin Malik menyebutkan, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Kemudian Allah 'azza wajalla mewajibkan kepada ummatku shalat sebanyak lima puluh kali. Maka aku pergi membawa perintah itu hingga aku berjumpa dengan Musa, lalu ia bertanya, 'Apa yang Allah perintahkan buat umatmu? ' Aku jawab: 'Shalat lima puluh kali.' Lalu dia berkata, 'Kembalilah kepada Rabbmu, karena umatmu tidak akan sanggup! ' Maka aku kembali dan Allah mengurangi setengahnya. Aku kemudian kembali menemui Musa dan aku katakan bahwa Allah telah mengurangi setengahnya. Tapi ia berkata, 'Kembalilah kepada Rabbmu karena umatmu tidak akan sanggup.' Aku lalu kembali menemui Allah dan Allah kemudian mengurangi setengahnya lagi.' Kemudian aku kembali menemui Musa, ia lalu berkata, 'Kembalilah kepada Rabbmu, karena umatmu tetap tidak akan sanggup.' Maka aku kembali menemui Allah Ta'ala, Allah lalu berfirman: 'Lima ini adalah sebagai pengganti dari lima puluh. Tidak ada lagi perubahan keputusan di sisi-Ku! ' Maka aku kembali menemui Musa dan ia kembali berkata, 'Kembailah kepada Rabb-Mu! ' Aku katakan, 'Aku malu kepada Rabbku.' Jibril lantas membawaku hingga sampai di Sidratul Muntaha yang diselimuti dengan warna-warni yang aku tidak tahu benda apakah itu. Kemudian aku dimasukkan ke dalam surga, ternyata di dalamnya banyak kubah-kubah terbuat dari mutiara dan tanahnya dari minyak kesturi.\"","created_at":"2017-07-17 03:44:26","updated_at":"2017-07-17 03:44:26"},{"id":101,"id_bab":79,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Shalih bin Kaisan dari 'Urwah bin Az Zubair dari 'Aisyah Ibu kaum Mu'minin, ia berkata, \"Allah telah mewajibkan shalat, dan awal diwajibkannya adalah dua rakaat dua rakaat, baik saat mukim atau saat dalam perjalanan. Kemudian ditetapkanlah ketentuan tersebut untuk shalat safar (dalam perjalanan), dan ditambahkan lagi untuk shalat di saat mukim.\"","created_at":"2017-07-17 03:44:37","updated_at":"2017-07-17 03:44:37"},{"id":102,"id_bab":80,"isi":"Telah menceritakan kepada kami Abu 'Ashim dari Malik dari Abu Az Zanad dari 'Abdurrahman Al 'raj dari Abu Hurairah berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian shalat dengan menggunakan satu kain, hingga tidak selembar pun kain yang menutupi kedua pundaknya.\"","created_at":"2017-07-17 03:45:13","updated_at":"2017-07-17 03:45:13"},{"id":103,"id_bab":80,"isi":"Telah menceritakan kepada kami Abu Nu'aim berkata, telah menceritakan kepada kami Syaiban dari Yahya bin Abu Katsir dari 'Ikrimah berkata, \"Aku pernah mendengar, atau aku pernah bertanya kepadanya, ia berkata, \"Aku mendengar Abu Hurairah berkata, \"Aku bersumpah bahwa aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa shalat dengan menggunakan satu kain, maka hendaklah ia serempangkan pada kedua pundaknya.\"","created_at":"2017-07-17 03:45:19","updated_at":"2017-07-17 03:45:19"},{"id":104,"id_bab":81,"isi":"Telah menceritakan kepada kami Sulaiman bin Harb berkata, telah menceritakan kepada kami Hammad bin Zaid dari Ayyub dari Muhammad dari Abu Hurairah berkata, \"Seorang laki-laki datang dan bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang shalat dengan menggunakan satu lembar baju. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Apakah setiap kalian memiliki dua helai baju?\" Kemudian ada seseorang bertanya kepada 'Umar, lalu ia menjawab, \"Jika Allah memberi kelapangan (kemudahan), maka pergunakanlah.\" Bila seseorang memiliki banyak pakaian, maka dia shalat dengan pakaiannya itu. Ada yang shalat dengan memakai kain dan rida (selendang besar), ada yang memakai kain dan gamis (baju panjang sampai kaki), ada yang memakai kain dan baju, ada yang memakai celana panjang dan rida', ada yang memakai celana \r\npanjang dan gamis, ada yang memakai celana panjang dan baju, ada yang memakai celana pendek dan rida', ada yang memakai celana pendek dan gamis.\" Abu Hurairah berkata, \"Menurutku 'Umar mengatakan, \"Dan ada yang memakai celana pendek dan rida'.\"","created_at":"2017-07-17 03:46:02","updated_at":"2017-07-17 03:46:02"},{"id":105,"id_bab":81,"isi":"Telah menceritakan kepada kami 'Ashim bin 'Ali berkata, telah menceritakan kepada kami Ibnu Abu Dzi'b dari Az Zuhri dari Salim dari Ibnu 'Umar berkata, \"Ada seseorang bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \"Apa yang harus dikenakan oleh seseorang saat ihram?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Dia tidak boleh mengenakan baju, celana, mantel dan tidak boleh pula pakaian yang diberi minyak wangi atau wewangian dari daun tumbuhan. Dan siapa yang tidak memiliki sandal, ia boleh mengenakan sepatu tapi hendaklah dipotong hingga berada dibawah mata kaki.\" Dan dari Nafi' dari Ibnu 'Umar dari Nabi shallallahu 'alaihi wasallam seperti ini juga.\"","created_at":"2017-07-17 03:46:11","updated_at":"2017-07-17 03:46:11"},{"id":106,"id_bab":82,"isi":"Telah menceritakan kepada kami Ahmad bin Yunus berkata, telah menceritakan kepada kami Ibrahim bin Sa'd berkata, telah menceritakan kepada kami Ibnu Syihab dari 'Urwah dari 'Aisyah bahwa Nabi shallallahu 'alaihi wasallam shalat di atas kain yang bergambar. Lalu beliau melihat kepada gambar tersebut. Selesai shalat beliau berkata: \"Pergilah dengan membawa kain ini kepada Abu Jahm dan gantilah dengan pakaian polos dari Abu Jahm. Sungguh kain ini tadi telah mengganggu shalatku.\" Hisyam bin 'Urwah berkata dari Bapaknya dari 'Aisyah berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Aku melihat pada gambarnya dan aku khawatir gambar itu menggangguku.","created_at":"2017-07-17 03:46:45","updated_at":"2017-07-17 03:46:45"},{"id":107,"id_bab":83,"isi":"Telah menceritakan kepada kami Muhammad bin 'Ar'arah berkata, telah menceritakan kepadaku 'Umar bin Abu Za'idah dari 'Aun bin Abu Juhaifah dari Bapaknya berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam berada dalam kemah merah yang terbuat dari kulit yang disamak. Dan aku lihat Bilal mengambilkan air wudlu untuk Rasulullah shallallahu 'alaihi wasallam, dan aku lihat orang-orang saling berebut air tersebut. Orang yang mendapatkanya maka ia langsung mengusapkannya, dan bagi yang tidak maka ia mengambilnya dari dari tangan temannya yang basah. Kemudian aku lihat Bilal mengambil tombak kecil dan menancapkannya di tanah, lalu Nabi shallallahu 'alaihi wasallam keluar dengan mengenakan pakaian merah menghadap ke arah tombak kecil dan memimpin orangorang shalat sebanyak dua raka'at. Dan aku lihat orang-orang dan hewan berlalu melewati depan tombak tersebut.\"","created_at":"2017-07-17 03:47:08","updated_at":"2017-07-17 03:47:08"},{"id":108,"id_bab":84,"isi":"Telah menceritakan kepada kami 'Ali bin 'Abdullah berkata, telah menceritakan kepada kami Sufyan berkata, telah menceritakan kepada kami Abu Hazim berkata, \"Orang-orang bertanya kepada Sahal bin Sa'd tentang terbuat dari apa mimbar Rasulullah? Maka dia berkata, \"Tidak ada seorangpun yang masih hidup dari para sahabat yang lebih mengetahui masalah ini selain aku. Mimbar itu terbuat dari batang pohon hutan yang tak berduri, mimbar itu dibuat oleh seorang budak wanita untuk Rasulullah shallallahu 'alaihi wasallam. Ketika selesai dibuat dan diletakkan, Rasulullah shallallahu 'alaihi wasallam berdiri pada mimbar tersebut menghadap kiblat. Beliau bertakbir dan orang-orang pun ikut shalat dibelakangnya, beliau lalu membaca surat lalu rukuk, dan orang-orang pun ikut rukuk di belakangnya. Kemudian beliau mengangkat kepalanya, lalu mundur ke belakang turun dan sujud di atas tanah. Kemudian beliau kembali ke atas mimbar dan rukuk, kemudian mengangkat kepalnya lalu turun kembali ke tanah pada posisi sebelumnya dan sujud di tanah. Itulah keberadaan mimbar.\" Abu 'Abdullah berkata, 'Ali Al Madini berkata, Ahmad bin \r\nHambal rahimahullah bertanya kepadaku tentang hadits ini. Ia katakan, \"Yang aku maksudkan bahwa Nabi shallallahu 'alaihi wasallam posisinya lebih tinggi daripada orangorang. Maka tidak mengapa seorang imam posisinya lebih tinggi daripada Makmum berdasarkan hadits ini.\" Sahl bin Sa'd berkata, \"Aku katakan, \"Sesungguhnya Sufyan bin 'Uyainah sering ditanya tentang masalah ini, 'Apakah kamu tidak pernah mendengarnya? ' Ahmad bin Hambal rahimahullah menjawab, \"Tidak.\"","created_at":"2017-07-17 03:47:30","updated_at":"2017-07-17 03:47:30"},{"id":109,"id_bab":84,"isi":"Telah menceritakan kepada kami Muhammad bin 'Abdurrahim berkata, telah menceritakan kepada kami Yazid bin Harun berkata, telah mengabarkan kepada kami Humaid Ath Thawil dari Anas bin Malik, bahwa Rasulullah shallallahu 'alaihi wasallam pernah terjatuh dari kudanya hingga mengakibatkan betisnya atau bahunya terluka. Maka Nabi shallallahu 'alaihi wasallam menjauhi isteri-isterinya selama sebulan. Beliau lalu duduk di ruangan yang agak tinggi yang tangganya terbuat dari kayu. Para sahabatnya lalu mengunjunginya, Beliau lalu shalat mengimami mereka dengan duduk sedangkan para sahabatnya shalat dengan berdiri. Setelah salam, beliau bersabda: \"Sesungguhnya dijadikannya imam itu untuk diikuti. Jika imam bertakbir maka takbirlah kalian, jika rukuk maka rukuklah kalian, jika sujud maka sujudlah kalian, dan jika ia shalat dengan berdiri maka shalatlah kalian dengan berdiri.\" Kemudian Beliau shallallahu 'alaihi wasallam turun kembali setelah dua puluh sembilan hari. Mereka pun berkata, \"Wahai Rasulullah, bukankan engkau mengasingkan diri selama satu bulan? Beliau menjawab: \"Satu bulan itu dua puluh sembailan hari.\"","created_at":"2017-07-17 03:47:39","updated_at":"2017-07-17 03:47:39"},{"id":110,"id_bab":85,"isi":"Telah menceritakan kepada kami Musaddad dari Khalid berkata, telah menceritakan kepada kami Sulaiman Asy Syaibani dari 'Abdullah bin Syidad dari Maimunah ia berkata, \"Pernah Rasulullah shallallahu 'alaihi wasallam shalat sementara aku berada di sampingnya, dan saat itu aku sedang haid. Dan setiapkali beliau sujud, pakaian beliau mengenai aku. Dan beliau shalat di atas tikar kecil.\"","created_at":"2017-07-17 03:47:58","updated_at":"2017-07-17 03:47:58"},{"id":111,"id_bab":86,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Ishaq bin 'Abdullah bin Abu Thalhah dari Anas bin Malik bahwa neneknya, Mulaikah, mengundang Rasulullah shallallahu 'alaihi wasallam untuk menghadiri hidangan yang ia masak untuk beliau. Beliau kemudian menyantap makanan tersebut kemudian bersabda: \"Berdirilah, aku akan pimpin kalian shalat.\" Anas berkata, \"Maka aku berdiri di tikar milik kami yang sudah lusuh dan hitam akibat sering digunakan. Aku lalu memercikinya dengan air, kemudian Rasulullah shallallahu 'alaihi wasallam berdiri diatasnya. Aku dan seorang anak yatim lalu membuat barisan di belakang beliau, sementara orang tua (nenek) berdiri di belakang kami. Rasulullah shallallahu 'alaihi wasallam lalu shalat memimpim kami sebanyak dua rakaat lalu pergi.\"","created_at":"2017-07-17 03:48:16","updated_at":"2017-07-17 03:48:16"},{"id":112,"id_bab":87,"isi":"Telah menceritakan kepada kami Abu Al Walid berkata, telah menceritakan kepada kami Syu'bah berkata, telah menceritakan kepada kami Sulaiman Asy Syaibani dari 'Abdullah bin Syaddad dari Maimunah ia berkata, \"Nabi shallallahu 'alaihi wasallam shalat di atas tikar kecil.\"","created_at":"2017-07-17 03:48:40","updated_at":"2017-07-17 03:48:40"},{"id":113,"id_bab":88,"isi":"Telah menceritakan kepada kami Isma'il berkata, telah menceritakan kepadaku Malik dari Abu An Nadlr mantan budak 'Umar bin 'Ubaidullah, dari Abu Salamah bin 'Abdurrahman dari 'Aisyah isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Aku pernah tidur di depan \r\nRasulullah shallallahu 'alaihi wasallam sementara kedua kakiku di arah Qiblat (shalatnya). Jika sujud beliau menyentuh kakiku, maka aku tarik kedua kakiku. Dan jika berdiri aku kembali meluruskan kakiku.\" 'Aisyah berkata, \"Pada saat itu di rumah-rumah belum ada lampu penerang.\"","created_at":"2017-07-17 03:48:57","updated_at":"2017-07-17 03:48:57"},{"id":114,"id_bab":88,"isi":"Telah menceritakan kepada kami Yahya bin Bukair berkata, telah menceritakan kepada kami Al Laits telah menceritakan kepadaku 'Uqail dari Ibnu Syihab berkata, telah mengabarkan kepadaku 'Urwah bahwa 'Aisyah mengabarkan kepadanya, bahwa ketika Rasulullah shallallahu 'alaihi wasallam sedang shalat Aisyah pernah tidur di arah kiblat beliau, ia tidur di atas kasur dengan posisi seperti jenazah.\"","created_at":"2017-07-17 03:49:05","updated_at":"2017-07-17 03:49:05"},{"id":115,"id_bab":88,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah menceritakan kepada kami Al Laits dari Yazid dari 'Irak dari 'Urwah, bahwa ketika Nabi shallallahu 'alaihi wasallam sedang shalat, 'Aisyah berbaring antara beliau dengan arah kiblatnya, di atas tempat tidur yang digunakan untuk tidur keduanya.\"","created_at":"2017-07-17 03:49:13","updated_at":"2017-07-17 03:49:13"},{"id":116,"id_bab":89,"isi":"Telah menceritakan kepada kami Abu Al Walid Hisyam bin 'Abdul Malik berkata, telah menceritakan kepada kami Bisyir bin Al Mufadlal berkata, telah menceritakan kepadaku Ghalib Al Qaththan dari Bakar bin 'Abdullah dari Anas bin Malik berkata, \"Kami shalat bersama Nabi shallallahu 'alaihi wasallam, lalu salah seorang dari kami meletakkan salah satu dari ujung bajunya di tempat sujudnya karena panasnya tempat sujud.\"","created_at":"2017-07-17 03:49:31","updated_at":"2017-07-17 03:49:31"},{"id":117,"id_bab":90,"isi":"Telah menceritakan kepada kami Adam bin Abu Iyas berkata, telah menceritakan kepada kami Syu'bah berkata, telah mengabarkan kepada kami Abu Maslamah Sa'id bin Yazid Al Azdi berkata, \"Aku bertanya kepada Anas bin Malik, \"Apakah Nabi shallallahu 'alaihi wasallam pernah shalat dengan memakai sandal?\" Dia menjawab, \"Ya.\"","created_at":"2017-07-17 03:50:01","updated_at":"2017-07-17 03:50:01"},{"id":118,"id_bab":91,"isi":"Telah mengabarkan kepada kami Ash Shaltu bin Muhammad telah mengabarkan kepada kami Mahdi dari Washil dari Abu Wa'il dari Hudzaifah, bahwa ia melihat seorang lakilaki tidak sempurna dalam rukuk dan sujudnya. Setelah orang itu selesai shalat, Hudzaifah berkata kepadanya, \"Kamu belum shalat!\" Orang itu berkata, \"Aku rasa sudah cukup.\" Hudzaifah berkata lagi, \"Seandainya kamu meninggal, maka kamu meninggal dunia bukan di atas sunah Muhammad shallallahu 'alaihi wasallam.\"","created_at":"2017-07-17 03:50:22","updated_at":"2017-07-17 03:50:22"},{"id":119,"id_bab":92,"isi":"Telah mengabarkan kepada kami Yahya bin Bukair telah menceritakan kepada kami Bakar bin Mudlar dari Ja'far bin Rabi'ah dari Ibnu Hurmuz dari 'Abdullah bin Malik bin Buhainah, bahwa jika Nabi shallallahu 'alaihi wasallam shalat, beliau membentangkan kedua lengannya hingga tampak putih ketiaknya.\" Al Laits berkata, telah menceritakan kepadaku Ja'far bin Rabi'ah seperti itu.\"","created_at":"2017-07-17 03:50:39","updated_at":"2017-07-17 03:50:39"},{"id":120,"id_bab":93,"isi":"Telah menceritakan kepada kami 'Amru bin 'Abbas berkata, telah menceritakan kepada kami Ibnu Al Mahdi berkata, telah menceritakan kepada kami Manshur bin Sa'd dari Maimun bin Siyah dari Anas bin Malik ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa shalat seperti shalat kita, menghadap ke arah kiblat kita dan memakan sembilan kita, maka dia adalah seorang Muslim, ia memiliki perlindungan dari Allah dan Rasul-Nya. Maka janganlah kalian mendurhakai Allah dengan mencederai perlindunganNya.\"","created_at":"2017-07-17 03:51:33","updated_at":"2017-07-17 03:51:33"},{"id":121,"id_bab":93,"isi":"Telah menceritakan kepada kami Nu'aim berkata, telah menceritakan kepada kami Ibnu Al Mubarak dari Humaid Ath Thawil dari Anas bin Malik berkata, \"Rasulullah shallallahu \r\n'alaihi wasallam bersabda: \"Aku diperintah untuk memerangi manusia hingga mereka mengucapkan Laa ilaaha illallah (Tidak ada Tuhan yang berhak disembah selain Allah) '. Jika mereka mengucapkannya kemudian mendirikan shalat seperti shalat kita, menghadap ke kiblat kita dan menyembelih seperti cara kita menyembelih, maka darah dan harta mereka haram (suci) bagi kita kecuali dengan hak Islam dan perhitungannya ada pada Allah.\" Ibnu Abu Maryam berkata, telah mengabarkan kepada kami Yahya bin Ayyub telah menceritakan kepada kami Humaid telah menceritakan kepada kami Anas dari Nabi shallallahu 'alaihi wasallam. Dan 'Ali bin 'Abdullah berkata, telah menceritakan kepada kami Khalid bin Al Harits berkata, telah menceritakan kepada kami Humaid berkata, \"Maimun bin Siyah bertanya kepada Anas bin Malik, \"Wahai Abu Hamzah, apa yang menjadikan haramnya darah dan harta seorang hamba?\" Ali menjawab, \"Siapa yang bersaksi Laa ilaaha illallah (Tidak ada Tuhan yang berhak disembah selain Allah), menghadap ke kiblat kita, shalat sepeti shalat kita dan memakan sembelihan kita, maka dia adalah Muslim, baginya hak dan kewajiban seorang Muslim.\"","created_at":"2017-07-17 03:51:44","updated_at":"2017-07-17 03:51:44"},{"id":122,"id_bab":94,"isi":"Telah menceritakan kepada kami 'Abdullah bin Raja' berkata, telah menceritakan kepada kami Israil dari Abu Ishaq dari Al Bara' bin 'Azib? radliallahu 'anhuma berkata, \"Rasulullah shallallahu 'alaihi wasallam shalat mengahdap Baitul Maqdis selama enam belas atau tujuh belas bulan, dan Rasulullah shallallahu 'alaihi wasallam menginginkan kiblat tersebut dialihkan ke arah Ka'bah. Maka Allah menurunkan ayat: (\"Sungguh Kami (sering) melihat mukamu menengadah ke langit) ' (Qs. Al Baqarah: 144). Maka kemudian Nabi shallallahu 'alaihi wasallam menghadap ke Ka'bah. Lalu berkatalah orang-orang yang kurang akal, yaitu orang-orang Yahudi: '(Apakah yang memalingkan mereka (umat Islam) dari kiblatnya (Baitul Maqdis) yang dahulu mereka telah berkiblat kepadanya?\" Katakanlah: \"Kepunyaan Allah-lah timur dan barat. Dia memberi petunjuk kepada siapa yang dikehendaki-Nya ke jalan yang lurus) ' (As. Al Baqarah: 144). Kemudian ada seseorang yang ikut shalat bersama Nabi shallallahu 'alaihi wasallam, orang itu kemudian keluar setelah menyelesikan shalatnya. Kemudian orang itu melewati Kaum Anshar yang sedang melaksanakan shalat 'Ashar dengan menghadap Baitul Maqdis. Lalu orang itu bersaksi bahwa dia telah shalat bersama Rasulullah shallallahu 'alaihi wasallam dengan menghadap Ka'bah. Maka orang-orang itu pun berputar dan menghadap Ka'bah.\"","created_at":"2017-07-17 03:52:16","updated_at":"2017-07-17 03:52:16"},{"id":123,"id_bab":94,"isi":"Telah menceritakan kepada kami Muslim bin Ibrahim berkata, telah menceritakan kepada kami Hisyam bin Abu 'abdullah berkata, telah menceritakan kepada kami Yahya bin Abu Katsir dari Muhammad bin 'Abdurrahman dari Jabir bin 'Abdullah berkata, \"Rasulullah shallallahu 'alaihi wasallam shalat diatas tunggangannya menghadap kemana arah tunggangannya menghadap. Jika Beliau hendak melaksanakan shalat yang fardlu, maka beliau turun lalu shalat menghadap kiblat.\"","created_at":"2017-07-17 03:52:26","updated_at":"2017-07-17 03:52:26"},{"id":124,"id_bab":94,"isi":"Telah menceritakan kepada kami 'Utsman berkata, telah menceritakan kepada kami Jarir dari Manshur dari Ibrahim dari 'Alqamah berkata, Abdullah berkata, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat.\" Ibrahim melanjutkan, \"Tapi aku tidak tahu apakah beliau kelebihan rakaat atau kurang. Setelah salam, beliau pun ditanya: \"Wahai Rasulullah, telah terjadi sesuatu dalam shalat!. Beliau bertanya: \"Apakah itu?\" Maka mereka menjawab, \"Tuan shalat begini dan begini.\" Beliau kemudian duduk pada kedua kakinya menghadap kiblat, kemudian beliau sujud dua kali, kemudian salam. Ketika menghadap ke arah kami, beliau bersabda: \"Seungguhnya bila ada sesuatu yang baru dari shalat pasti aku beritahukan kepada kalian. Akan tetapi aku ini hanyalah manusia seperti kalian yang bisa lupa sebagaimana kalian juga bisa lupa, maka jika aku terlupa ingatkanlah. Dan jika seseorang dari kalian ragu dalam shalatnya maka dia harus meyakini mana yang benar, kemudian hendaklah ia sempurnakan, lalu salam kemudian sujud dua kali.\"","created_at":"2017-07-17 03:52:35","updated_at":"2017-07-17 03:52:35"},{"id":125,"id_bab":95,"isi":"Telah menceritakan kepada kami 'Amru bin 'Aun berkata, telah menceritakan kepada kami Husyaim dari Humaid dari Anas bin Malik berkata, 'Umar bin Al Khaththab, \"Aku memiliki pemikiran yang aku ingin jika itu dikabulkan oleh Rabbku dalam tiga persoalan. Maka aku sampaikan kepada Rasulullah shallallahu 'alaihi wasallam, 'Wahai Rasulullah, seandainya Maqam Ibrahim kita jadikan sebagai tempat shalat? Lalu turunlah ayat: '(Dan jadikanlah sebahagian maqam Ibrahim sebagai tempat shalat) ' (Qs. Al Baqarah: 125). Yang kedua tentang hijab. Aku lalu berkata, 'Wahai Rasulullah, seandainya Tuan perintahkan \r\nisteri-isteri Tuan untuk berhijab karena yang berkomunikasi dengan mereka ada orang yang shalih dan juga ada yang fajir (suka bermaksiat).' Maka turunlah ayat hijab. Dan yang ketiga, saat isteri-isteri beliau cemburu kepada beliau (sehingga banyak yang membangkang), aku katakan kepada mereka, 'Semoga bila Beliau menceraikan kalian Rabbnya akan menggantinya dengan isteri-isteri yang lebih baik dari kalian.' Maka turunlah ayat tentang masalah ini.\" Abu Abdullah berkata; telah menceritakan kepada kami Ibnu Abu Maryam berkata, telah mengabarkan kepada kami Yahya bin Ayyub berkata, telah menceritakan kepadaku Humaid ia berkata, Aku mendengar Anas seperti hadits ini.\"","created_at":"2017-07-17 03:52:54","updated_at":"2017-07-17 03:52:54"},{"id":126,"id_bab":95,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik bin Anas dari 'Abdullah bin Dinar dari 'Abdullah bin 'Umar berkata, \"Ketika orang-orang shalat subuh di Quba', tiba-tiba datang seorang laki-laki dan berkata, \"Sungguh, tadi malam telah turun ayat kepada Rasulullah shallallahu 'alaihi wasallam, beliau diperintahkan untuk menghadap ke arah Ka'bah. Maka orang-orang yang sedang shalat berputar menghadap Ka'bah, padahal pada saat itu wajah-wajah mereka sedang menghadap negeri Syam. Mereka kemudian berputar ke arah Ka'bah.\"","created_at":"2017-07-17 03:53:00","updated_at":"2017-07-17 03:53:00"},{"id":127,"id_bab":95,"isi":"Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepada kami Yahya dari Syu'bah dari Al Hakam dari Ibrahim dari 'Alqamah dari 'Abdullah berkata, \"Nabi shallallahu 'alaihi wasallam pernah melaksanakan shalat Zhuhur lima rakaat. Maka orangorang berkata, \"Apakah ada tambahan dalam shalat?\" Beliau balik bertanya: \"Apakah yang terjadi?\" Mereka menjawab, \"Tuan telah shalat sebanyak lima rakaat.\" Maka beliau pun duduk di atas kedua kakinya lalu sujud dua kali.\"","created_at":"2017-07-17 03:53:08","updated_at":"2017-07-17 03:53:08"},{"id":128,"id_bab":96,"isi":"Telah menceritakan kepada kami Yahya bin Bukair berkata, telah telah menceritakan kepada kami Al Laits dari 'Uqail dari Ibnu Syihab dari Humaid bin 'Abdurrahman bahwa Abu Hurairah dan Abu Sa'id keduanya mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam pernah melihat ludah pada dinding masjid, maka Rasulullah shallallahu 'alaihi wasallam mengambil batu kerikil dan menggosoknya. Kemudian beliau bersabda: \"Jika salah seorang dari kalian meludah janganlah ia meludah ke arah kiblat atau ke sebelah kanannya, tapi hendaklah ia lakukan ke arah kiri atau di bawah kaki kirinya.\"","created_at":"2017-07-17 03:53:33","updated_at":"2017-07-17 03:53:33"},{"id":129,"id_bab":96,"isi":"Telah menceritakan kepada kami Hafsh bin 'Umar telah menceritakan kepada kami Syu'bah berkata, telah mengabarkan kepadaku Qatadah berkata, aku mendengar Anas bin Malik berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan sekali-kali salah seorang dari kalian meludah ke arah depan atau samping kanannya, tapi hendaklah ke arah kiri atau di bawah kakinya.\"","created_at":"2017-07-17 03:53:41","updated_at":"2017-07-17 03:53:41"},{"id":130,"id_bab":97,"isi":"Telah menceritakan kepada kami Adam berkata, telah menceritakan kepada kami Syu'bah berkata, telah menceritakan kepada kami Qatadah berkata, aku mendengar Anas \r\nbin Malik berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Jika seorang Mukmin sedang shalat, sesungguhnya ia sedang berhadapan dengan Rabbnya. Maka janganlah ia meludah ke arah depan atau sebelah kanannya, namun hendaklah ia melakukannya ke arah kiri atau di bawah kakinya.\"","created_at":"2017-07-17 03:54:01","updated_at":"2017-07-17 03:54:01"},{"id":131,"id_bab":97,"isi":"Telah menceritakan kepada kami 'Ali bin 'Abdullah berkata, telah menceritakan kepada kami Sufyan telah menceritakan kepada kami Az Zuhri dari Humaid bin 'Abdurrahman dari Abu Sa'id bahwa Nabi shallallahu 'alaihi wasallam melihat ludah pada arah kiblat masjid, beliau lalu menggosoknya dengan batu kerikil. Kemudian beliau melarang seorang laki-laki meludah ke arah depan atau sebelah kanannya. Tetapi hendaklah ia melakukannya ke arah kiri atau ke bawah kaki kirinya.\" Dan dari Az Zuhri ia mendengar Humaid dari Abu Sa'id seperti ini.\"","created_at":"2017-07-17 03:54:30","updated_at":"2017-07-17 03:54:30"},{"id":132,"id_bab":98,"isi":"Telah menceritakan kepada kami 'Abdullah bin Maslamah berkata; Aku membacakannya di hadapan Malik dari Ibnu Syihab bahwa 'Umar bin 'Abdul 'Aziz pada suatu hari mengakhirkan pelaksanaan shalat. Kemudian 'Urwah bin Az Zubair datang menemuinya dan mengabarkan kepadanya bahwa Al Mughirah bin Syu'bah pada suatu hari juga pernah mengakhirkan shalat, dan saat itu dia tinggal di 'Irak. Kemudian Abu Mas'ud Al Anshari datang menemuinya seraya berkata, \"Apa yang kamu lakukan ini wahai Al Mughirah? Bukankah kamu telah mengetahui bahwa Malaikat Jibril shallallahu 'alaihi wasallam pernah turun kemudian melaksanakan shalat, kemudian Rasulullah shallallahu 'alaihi wasallam juga ikut melaksanakan shalat? Kemudian Jibril shalat lagi dan Rasulullah shallallahu 'alaihi wasallam juga ikut shalat kembali? Kemudian Jibril shalat lagi dan Rasulullah shallallahu 'alaihi wasallam juga ikut shalat kembali? Kemudian Jibril shalat lagi dan Rasulullah shallallahu 'alaihi wasallam juga ikut shalat kembali? Kemudian Jibril shalat lagi dan Rasulullah shallallahu 'alaihi wasallam juga ikut shalat kembali? Kemudian Jibril berkata, \"Inilah waktu-waktu yang diperintahkan kepadaku (agar engkau melaksanakannya).\" 'Umar lalu berkata kepada 'Urwah, \"Ketahuilah apa yang kamu ceritakan! Sesungguhnya Jibril datang untuk menjelaskan kepada Rasulullah shallallahu 'alaihi wasallam tentang waktuwaktu shalat.\" 'Urwah berkata, \"Begitulah adanya. bahwasanya Basyir bin Abu Mas'ud menceritakan dari Bapaknya. Urwah berkata, \" Aisyah menceritakan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam pernah melaksanakan shalat 'Ashar, sementara cahaya matahari yang ada dalam kamarnya belum nampak.\"","created_at":"2017-07-17 03:55:31","updated_at":"2017-07-17 03:55:31"},{"id":133,"id_bab":100,"isi":"Telah menceritakan kepada kami Qutaibah bin Sa'id berkata, telah menceritakan kepada kami 'Abbad -yaitu Ibnu 'Abbad- dari Abu Hamzah dari Ibnu 'Abbas berkata, \"Utusan 'Abdul Qais datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Sesungguhnya kami dari suku Rabi'ah, dan kami tidak dapat mengunjungi tuan kecuali pada bulan haram. Maka perintahlah kepada kami dengan sesuatu yang kami ambil dari tuan dan dapat kami sampaikan kepada penduduk kami. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Aku perintahkan kalian dengan empat perkara dan aku larang dari empat perkara; Iman kepada Allah. Lalu Nabi shallallahu 'alaihi wasallam menjelaskan kepada mereka; yaitu persaksian bahwa tidak ada Tuhan yang berhak disembah selain Allah dan Muhammad adalah utusan Allah, menegakkan shalat, menunaikan zakat, pusa Ramadan dan kalian kelurakan seperlima dari harta rampasan perang. Dan aku larang kalian dari Ad Duba`, Al Hantam, Al Muqayyar dan An Naqir.\"","created_at":"2017-07-17 03:57:04","updated_at":"2017-07-17 03:57:04"},{"id":134,"id_bab":101,"isi":"Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepada kami Yahya dari Al A'masy berkata, telah menceritakan kepadaku Syaqiq berkata, Aku pernah mendengar Hudzaifah berkata, \"Kami pernah bermajelis bersama 'Umar, lalu ia berkata, \"Siapa di antara kalian yang masih ingat sabda Rasulullah shallallahu 'alaihi wasallam tentang masalah fitnah? ' Aku lalu menjawab, 'Aku masih ingat seperti yang beliau sabdakan! ' 'Umar bertanya, \"Kamu dengar dari beliau atau kamu mendengar perkataan itu dari orang lain?\" Aku menjawab, 'Yaitu fitnah seseorang dalam keluarganya, harta, anak dan tetangganya. Dan fitnah itu akan terhapus oleh amalan shalat, puasa, sedekah, amar ma'ruf dan nahi munkar.\" 'Umar berkata, \"Bukan itu yang aku mau. Tapi fitnah yang dahsyat seperti dahsyatnya air laut.\" Hudzaifah berkata, \"Wahai Amirul Mukminin, sesungguhnya fitnah itu tidak akan membahayakan engkau! antara engkau dengannya terhalang oleh pintu yang tertutup.\" 'Umar bertanya; \"Pintu yang rusak atau terbuka?\" Hudzaifah menjawab, \"Rusak.\" 'Umar pun berkata, \"Kalau begitu tidak akan bisa ditutup selamanya! ' Kami (perawi) bertanya, \"Apakah 'Umar mengerti pintu yang dimaksud?\" Hudzaifah menjawab, \"Ya. Sebagaimana mengertinya dia bahwa setelah pagi adalah malam hari. Aku telah menceritakan kepadanya suatu hadits yang tidak ada kerancuannya.\" Namun kami takut untuk bertanya kepada Hudzaifah, lalu aku suruh Masruq untuk, lalu ia pun menanyakannya kepadanya. Hudzaifah lalu menjawab, \"Pintu itu adalah Umar.\"","created_at":"2017-07-17 03:57:26","updated_at":"2017-07-17 03:57:26"},{"id":135,"id_bab":101,"isi":"Telah menceritakan kepada kami Qutaibah berkata, telah menceritakan kepada kami Yazid bin Zurai' dari Sulaiman At Taimi dari Abu 'Utsman An Nahdi dari Ibnu Mas'ud, bahwa ada seorang laki-laki mencium seorang wanita, ia lalu mendatangi Nabi shallallahu 'alaihi wasallam dan mengabarkan kepada beliau. Maka turunlah firman Allah: '(Dan dirikanlah shalat pada kedua tepi siang (pagi dan petang) dan pada bahagian permulaan daripada malam. Sesungguhnya perbuatan-perbuatan yang baik itu menghapuskan (dosa) perbuatanperbuatan yang buruk).' (Qs. Huud: 114). Laki-laki itu lalu bertanya, \"Wahai Rasulullah, apakah ini khusus buatku?\" beliau menjawab: \"Untuk semua umatku.\"","created_at":"2017-07-17 03:57:36","updated_at":"2017-07-17 03:57:36"},{"id":136,"id_bab":102,"isi":"Telah menceritakan kepada kami Abu Al Walid Hisyam bin 'Abdul Malik berkata, telah menceritakan kepada kami Syu'bah berkata, telah mengabarkan kepadaku Al Walid bin Al 'Aizar berkata, Aku mendengar Abu 'Amru Asy Syaibani berkata, \"Pemilik rumah ini menceritakan kepada kami -seraya menunjuk rumah 'Abdullah - ia berkata, \"Aku pernah bertanya kepada Nabi shallallahu 'alaihi wasallam, \"Amal apakah yang paling dicintai oleh Allah?\" Beliau menjawab: \"Shalat pada waktunya.\" 'Abdullah bertanya lagi, \"Kemudian apa kagi?\" Beliau menjawab: \"Kemudian berbakti kepada kedua orangtua.\" 'Abdullah bertanya lagi, \"Kemudian apa kagi?\" Beliau menjawab: \"Jihad fi sabilillah.\" 'Abdullah berkata, \"Beliau sampaikan semua itu, sekiranya aku minta tambah, niscaya beliau akan menambahkannya untukku.\"","created_at":"2017-07-17 03:57:52","updated_at":"2017-07-17 03:57:52"},{"id":137,"id_bab":103,"isi":"Telah menceritakan kepada kami Musa bin Isma'il berkata, telah menceritakan kepada kami Mahdi dari Ghailan dari Anas berkata, \"Aku tidak pernah mengenal sasuatupun di zaman Rasulullah shallallahu 'alaihi wasallam seperti apa yang terjadi sekarang.\" Dikatakan kepadanya, \"Apakah yang kau maksud shalat?\" Anas berkata, \"Bukankah memang benar kalian telah melalaikannya?\"","created_at":"2017-07-17 03:58:07","updated_at":"2017-07-17 03:58:07"},{"id":138,"id_bab":103,"isi":"Telah menceritakan kepada kami 'Amru bin Zurarah berkata, telah mengabarkan kepada kami 'Abdul Wahid bin Washil Abu 'Ubaidah Al Haddad dari 'Utsman bin Abu Rawwad saudara Al 'Aziz bin Abu Rawwad, ia berkata, aku mendengar Az Zuhri berkata, \"Aku pernah menemui Anas bin Malik di Damaskus, sementara saat itu ia sedang menangis. Aku lalu bertanya, 'Apa yang membuatmu menangis? Anas lalu menjawab, \"Aku tidak pernah mengenal sasuatupun di zaman Rasulullah shallallahu 'alaihi wasallam seperti apa yang aku temui sekarang selain masalah shalat. Shalat sekarang ini sudah dilalaikan.\" Bakar bin Khalaf berkata, telah menceritakan kepada kami Muhammad bin Bakar Al Barsani telah mengabarkan kepada kami 'Utsman bin Abu Rawwad dengan hadits seperti ini.\"","created_at":"2017-07-17 03:58:15","updated_at":"2017-07-17 03:58:15"},{"id":139,"id_bab":104,"isi":"Telah menceritakan kepada kami Muslim bin Ibrahim berkata, telah menceritakan kepada kami Hisyam dari Qatadah dari Anas bin Malik berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian shalat bermunajat kepada Rabbnya, maka janganlah dia meludah ke sebelah kanannya, tetapi henklah ke sebelah kiri atau bawah kaki kirinya.\" Sa'id menyebutkan dari Qatadah, \"Janganlah dia meludah ke arah depannya, tetapi ke sebelah kiri atau di bawah kedua kakinya.\" Syu'bah menyebutkan: \"Janganlah ia meludah ke arah depan atau sebelah kanannya, tetapi hendaklah ke sebelah kiri atau di bawah kaki kirinya.\" Dan Humaid menyebutkan dari Anas dari Nabi shallallahu 'alaihi wasallam: \"Janganlah ia meludah ke arah kiblat atau sebelah kanannya, tetapi hendaklah ke sebelah kiri atau di bawah kakinya.\"","created_at":"2017-07-17 03:58:34","updated_at":"2017-07-17 03:58:34"},{"id":140,"id_bab":104,"isi":"Telah menceritakan kepada kami Hafsh bin 'Umar berkata, telah menceritakan kepada kami Yazid bin Ibrahim berkata, telah menceritakan kepada kami Qatadah dari Anas bin Malik dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seimbanglah dalam sujud dan janganlah seseorang meletakkan tangannya seperti anjing. Dan jika meludah, maka jangan sekali-kali ia meludah ke arah depan atau ke sebelah kanannya. Karena dia sedang berhadapan dengan Rabbnya.\"","created_at":"2017-07-17 03:58:40","updated_at":"2017-07-17 03:58:40"},{"id":141,"id_bab":105,"isi":"Telah menceritakan kepada kami Ibrahim bin Al Mundzir berkata, telah menceritakan kepada kami Anas bin 'Iyadl dari Hisyam dari Bapaknya bahwa 'Aisyah berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat 'Ashar sedangkan matahari belum berlalu dari kamarnya (rumah 'Aisyah).\" Abu Umamah menyebutkan dari Hisyam, \"Dari dalam kamarnya (posisi cahayanya).\"","created_at":"2017-07-17 03:59:29","updated_at":"2017-07-17 03:59:29"},{"id":142,"id_bab":105,"isi":"Telah menceritakan kepada kami Qutaibah berkata, telah menceritakan kepada kami Al Laits dari Ibnu Syihab dari 'Urwah dari 'Aisyah, bahwa Rasulullah shallallahu 'alaihi wasallam shalat 'Ashar sementara matahari yang ada dikamarnya belum menampakkan bayangbayang.\"","created_at":"2017-07-17 03:59:35","updated_at":"2017-07-17 03:59:35"},{"id":143,"id_bab":105,"isi":"Telah menceritakan kepada kami Abu Nu'aim berkata, telah mengabarkan kepada kami Ibnu 'Uyainah dari Az Zuhri dari 'Urwah dari 'Aisyah berkata, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat 'Ashar sementara matahari muncul dari dalam kamarku dan belum nampak bayang-bayang.\" Malik dan Yahya bin Sa'id dan Syu'aib dan Ibnu Abu Hafsh menyebutkan, \"Sementara matahari belum lagi nampak bayangannya.\"","created_at":"2017-07-17 03:59:42","updated_at":"2017-07-17 03:59:42"},{"id":144,"id_bab":105,"isi":"Telah menceritakan kepada kami Muhammad bin Muqatil berkata, telah mengabarkan kepada kami 'Abdullah berkata, telah mengabarkan kepada kami 'Auf dari Sayyar bin Salamah berkata, \"Aku dan bapakku datang menemui Abu Barzah Al Aslami. Lalu bapakku berkata kepadanya, \"Bagaimana Rasulullah shallallahu 'alaihi wasallam melaksanakan shalat yang diwajibkan?\" Abu Barzah menjawab, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat Zhuhur, yang kalian sebut sebagai waktu utama, saat matahari telah tergelincir, shalat 'Ashar ketika salah seorang dari kami kembali dengan kendaraannya di ujung Kota sementara matahari masih terasa panas sinarnya. Dan aku lupa apa yang dibaca beliau saat shalat Maghrib. Beliau lebih suka mengakhirkan shalat 'Isya yang kalian sebut dengan shalat 'atmah, dan beliau tidak suka tidur sebelum shalat Isya dan berbincang-bincang sesudahnya. Dan beliau melaksanakan shalat Shubuh ketika seseorang dapat mengetahui siapa yang ada di sebelahnya, beliau membaca enam hingga seratus ayat.\"","created_at":"2017-07-17 03:59:51","updated_at":"2017-07-17 03:59:51"},{"id":145,"id_bab":105,"isi":"Telah menceritakan kepada kami 'Abdullah bin Maslamah dari Malik dari Ishaq bin 'Abdullah bin Abu Thalhah dari Anas bin Malik berkata, \"Kami pernah shalat 'Ashar kemudian orang-orang keluar menuju Bani 'Amru bin 'Auf, dan kami dapati mereka sedang melaksanakan shalat 'Ashar.\"","created_at":"2017-07-17 03:59:58","updated_at":"2017-07-17 03:59:58"},{"id":146,"id_bab":105,"isi":"Telah menceritakan kepada kami Ibnu Muqatil berkata, telah mengabarkan kepada kami 'Abdullah berkata, telah mengabarkan kepada kami Abu Bakar bin Utsman bin Sahl bin Hunaif berkata, \"Aku mendengar Abu Umamah bin Sahl berkata, \"Kami pernah shalat Zhuhur bersama 'Umar bin 'Abdul 'Aziz. Setelah selesai kami keluar mendatangi Anas bin Malik, dan saat itu kami dapati mereka sedang melaksanakan shalat 'Ashar. Maka aku pun bertanya, \"Wahai paman, shalat apakah yang kamu kerjakan ini?\" Dia menjawab, \"Shalat 'Ashar. Saat seperti inilah shalat Rasulullah shallallahu 'alaihi wasallam yang pernah kami lakukan bersamanya.\"","created_at":"2017-07-17 04:00:05","updated_at":"2017-07-17 04:00:05"},{"id":147,"id_bab":105,"isi":"Telah menceritakan kepada kami Abu Al Yaman berkata, telah mengabarkan kepada kami Syu'aib dari Az Zuhrii berkata, telah menceritakan kepadaku Anas bin Malik berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah melaksanakan shalat 'Ashar saat matahari masih meninggi. Dan jika ada seseorang pergi menemui keluarganya kemudian kembali, maka ia akan mendapati matahari masih tinggi. Sedangkan sebagian desa jaraknya dengan Madinah ada yang berjarak sampai empat mil atau sekitar itu.\"","created_at":"2017-07-17 04:00:19","updated_at":"2017-07-17 04:00:19"},{"id":148,"id_bab":105,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Ibnu Syihab dari Anas bin Malik berkata, \"Kami pernah melakanakan shalat 'Ashar, dan jika salah seorang dari kami pergi ke Quba mendatangi mereka (penduduk), maka matahari masih tinggi.\"","created_at":"2017-07-17 04:00:26","updated_at":"2017-07-17 04:00:26"},{"id":149,"id_bab":106,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Nafi' dari 'Abdullah bin 'Umar, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang kehilangan shalat 'Ashar (dengan berjama'ah) seperti orang yang kehilangan keluarga dan hartanya.\" Saat menafsirkan ayat: '(Dia sekali-kali tidak akan mengurangi) ' (Qs. Muhammad: 35) Abu Abdullah berkata, \"Bila kamu membunuh seseorang atau kamu mengambil hartanya.\"","created_at":"2017-07-17 04:00:45","updated_at":"2017-07-17 04:00:45"},{"id":150,"id_bab":107,"isi":"Telah menceritakan kepada kami Muslim bin Ibrahim berkata, telah menceritakan kepada kami Hisyam berkata, telah menceritakan kepada kami Yahya bin Abu Katsir dari Abu Qilabah dari Al Malih berkata, \"Kami pernah bersama Buraidah pada suatu peperangan saat cuaca mendung, lalu ia berkata, \"Segeralah laksanakan shalat 'Ashar! Karena Nabi shallallahu 'alaihi wasallam pernah bersabda: \"Barangsiapa meninggalkan shalat 'Ashar sungguh hapuslah amalnya.\"","created_at":"2017-07-17 04:01:00","updated_at":"2017-07-17 04:01:00"},{"id":151,"id_bab":108,"isi":"Telah menceritakan kepada kami Al Humaidi berkata, telah menceritakan kepada kami Marwan bin Mu'awiyah berkata, telah menceritakan kepada kami Isma'il dari Qais dari Jarir bin 'Abdullah berkata, \"Pada suatu malam kami pernah bersama Nabi shallallahu 'alaihi wasallam, beliau lalu melihat ke arah bulan purnama. Kemudian beliau bersabda: \"Sesungguhnya kalian akan melihat Rabb kalian sebagaimana kalian melihat bulan purnama ini. Dan kalian tidak akan saling berdesakan dalam melihat-Nya. Maka jika kalian mampu untuk tidak terlewatkan untuk melaksanakan shalat sebelum terbit matahri dan sebelum terbenamnya, maka lakukanlah.\" Beliau kemudian membaca ayat: '(Dan bertasbihlah sambil memuji Rabbmu sebelum terbit matahari dan sebelum terbenamnya) ' (Qs. Qaaf: 39). Isma'il menyebutkan, \"Kerjakanlah dan sekali-kali jangan sampai kalian terlewatkan.\"","created_at":"2017-07-17 04:01:18","updated_at":"2017-07-17 04:01:18"},{"id":152,"id_bab":108,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah telah menceritakan kepada kami Malik dari Abu Az Zinad dari Al A'raj dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Para Malaikat malam dan Malaikat siang silih berganti mendatangi kalian. Dan mereka berkumpul saat shalat Fajar (Subuh) dan 'Ashar. Kemudian Malaikat yang menjaga kalian naik ke atas hingga Allah Ta'ala bertanya kepada mereka, dan Allah lebih mengetahui keadaan mereka (para hamba-Nya), 'Dalam keadaan bagaimana kalian tinggalkan hamba-hambaKu? ' Para Malaikat menjawab, 'Kami tinggalkan mereka dalam keadaan sedang mendirikan shalat. Begitu juga saat kami mendatangi mereka, mereka sedang mendirikan shalat'.\"","created_at":"2017-07-17 04:01:27","updated_at":"2017-07-17 04:01:27"},{"id":153,"id_bab":109,"isi":"Telah menceritakan kepada kami Abu An Nu'aim berkata, telah menceritakan kepada kami Syaiban dari Yahya bin Abu Katsir dari Abu Salamah dari Abu Hurairah ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seeorang dari kalian mendapatkan sujud shalat 'Ashar sebelum terbenam matahari maka sempurnakanlah, dan jika mendapatkan sujud shalat Subuh sebelum terbit matahari maka sempurnakanlah.\"","created_at":"2017-07-17 04:01:45","updated_at":"2017-07-17 04:01:45"},{"id":154,"id_bab":109,"isi":"Telah menceritakan kepada kami 'Abdul 'Aziz bin 'Abdullah Al Uwaisi berkata, telah menceritakan kepadaku Ibrahim bin Sa'ad dari Ibnu Syihab dari Salim bin 'Abdullah dari Bapaknya ia mengabarkan kepadanya, bahwa dia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya keberadaan kalian dibandingakan ummat-ummat sebelum kalian seperti masa antara shalat 'Ashar dan terbenamnya matahari. Ahlu Taurat diberikan Kitab Taurat, kemudian mereka mengamalkannya hingga apabila sampai pertengahan siang hari mereka menjadi lemah (tidak kuat sehingga melalaikannya). Maka mereka diberi pahala satu qirath satu qirath. Kemudian Ahlu Injil diberikan Kitab Injil, lalu mereka mengamalkannya hingga waktu shalat 'Ashar, dan mereka pun melemah. Maka merekapun diberi pahala satu qirath satu qirath. Sedangkan kita diberikan Al Qur'an, lalu kita mengamalkannya hingga matahari terbenam, maka kita diberi pahala dua qirath dua qirath. kedua Ahlul Kitab tersebut berkata, 'Wahai Rabb kami, bagaimana Engkau memberikan mereka dua qirath dua qirath dan Engkau beri kami satu qirath satu qirath. Padahal kami lebih banyak beramal! ' Beliau melanjutkan kisahnya: \"Maka Allah 'azza wajalla bertanya: 'Apakah Aku menzhalimi sesuatu dari bagian pahala kalian? ' Mereka menjawab, 'Tidak'. \r\nMaka Allah 'azza wajalla berfirman: 'Itulah karunia-Ku yang Aku berikan kepada siapa yang Aku kehendaki'.\"","created_at":"2017-07-17 04:02:04","updated_at":"2017-07-17 04:02:04"},{"id":155,"id_bab":109,"isi":"Telah menceritakan kepada kami Abu Kuraib berkata, telah menceritakan kepada kami Abu Usamah dari Buraid dari Abu Burdah dari Abu Musa dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Perumpaman Kaum Muslimin, Yahudi dan Nashara seperti seseorang yang memperkerjakan suatu Kaum, mereka harus bekerja untuknya hingga malam hari, sementara mereka hanya beramal hingga sianghari. Mereka berkata, 'Kami tidak patut menerima upah darimu. Akhirnya orang itu memperkerjakan Kaum yang lain dan berkata, 'Sempurnakanlah sisa hari yang ada, nanti kalian mendapatkan bagian upah sesuai persyaratanku.' Maka mereka mengerjakan pekerjaan hingga hanya sampai waktu 'Ashar, mereka lalu berkata, 'Kami kembalikan pekerjaan kepadamu.' Lalu orang itu memperkerjakan Kaum yang lain lagi. Maka Kaum tersebut bekerja menuntaskan sisa hari sampai matahari terbenam. Jadilah Kaum ini menyempurnakan pahala dua Kaum sebelumnya.\"","created_at":"2017-07-17 04:02:13","updated_at":"2017-07-17 04:02:13"},{"id":156,"id_bab":111,"isi":"Telah menceritakan kepada kami Muhammad bin Mihran berkata, telah menceritakan kepada kami Al Walid berkata, telah menceritakan kepada kami Al Awza'i berkata, telah menceritakan kepada kami Abu An Najasyi Shuhaib mantan budak Rafi' bin Khadij, ia berkata, \"Aku pernah mendengar Rafi' bin Khadij berkata, \"Kami pernah shalat Maghrib bersama Nabi shallallahu 'alaihi wasallam, ketika salah seorang dari kami berlalu pergi, maka ia masih dapat melihat tempat sandal kami.\"","created_at":"2017-07-17 04:02:31","updated_at":"2017-07-17 04:02:31"},{"id":157,"id_bab":111,"isi":"Telah menceritakan kepada kami Muhammad bin Basysyar berkata, telah menceritakan kepada kami Muhammad bin Ja'far berkata, telah menceritakan kepada kami Syu'bah dari Sa'ad bin Ibrahim dari Muhammad bin 'Amru bin Al Hasan bin 'Ali berkata, \"Al Hajjaj pernah menunda pelaksanaan shalat, maka kami bertanya kepada Jabir bin 'Abdullah. Maka dia menjawab, \"Nabi shallallahu 'alaihi wasallam melaksanakan shalat Zhuhur ketika matahari telah condong, shalat 'Ashar saat matahari masih terasa panas sinarnya, shalat Maghrib ketika matahari telah terbenam, dan shalat 'Isya terkadang beliau mengikuti kedaan jama'ah; jika beliau lihat sudah berkumpul maka beliau segerakan, dan jika mereka belum berkumpul maka beliau akhirkan. Sementara untuk shalat Subuh, mereka atau beliau melaksanakannya saat pagi masih gelap.\"","created_at":"2017-07-17 04:02:37","updated_at":"2017-07-17 04:02:37"},{"id":158,"id_bab":111,"isi":"Telah menceritakan kepada kami Al Makki bin Ibrahim berkata, telah menceritakan kepada kami Yazid bin Abu 'Ubaid dari Salamah berkata, \"Kami pernah shalat Maghrib bersama Nabi shallallahu 'alaihi wasallam ketika matahari sudah tenggelam tidak terlihat.\"","created_at":"2017-07-17 04:02:49","updated_at":"2017-07-17 04:02:49"},{"id":159,"id_bab":111,"isi":"Telah menceritakan kepada kami Adam berkata, telah menceritakan kepada kami Syu'bah berkata, 'Amru bin Dinar berkata, Aku pernah mendengar Jabir bin Zaid dari 'Abdullah bin 'Abbas berkata, \"Nabi shallallahu 'alaihi wasallam pernah melaksanakan shalat tujuh rakaat dengan jama' dan delapan rakaat dengan jama'.\"","created_at":"2017-07-17 04:02:54","updated_at":"2017-07-17 04:02:54"},{"id":160,"id_bab":112,"isi":"Telah menceritakan kepada kami Abu Ma'mar -yaitu 'Abdullah bin 'Amru- berkata, telah menceritakan kepada kami 'Abdul Warits dari Al Husain berkata, telah menceritakan kepada kami 'Abdullah bin Buraidah berkata, telah menceritakan kepadaku 'Abdullah bin Mughaffal Al Muzani, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian dikalahkan oleh orang Badui dalam menamakan (melaksanakan) shalat Maghrib kalian.\" 'Abdullah bin \r\nMughaffal Al Muzani berkata, \"Orang Badui menyebut Maghrib dengan 'Isya (kerena mereka menunda pelaksanaan Maghrib hingga masuk waktu 'Isya).\"","created_at":"2017-07-17 04:03:13","updated_at":"2017-07-17 04:03:13"},{"id":161,"id_bab":113,"isi":"Telah menceritakan kepada kami 'Abdan berkata, telah mengabarkan kepada kami 'Abdullah berkata, telah mengabarkan kepada kami Yunus dari Az Zuhri, Salim berkata, 'Abdullah mengabarkan kepadaku, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah memimpin kami melaksanakan shalat 'Isya pada waktu yang orang-orang menyebutnya dengan sebutan 'Atamah. Selesai shalat beliau berpaling dan menghadap ke arah kami seraya bertanya: \"Tidakkah kalian melihat malam kalian ini? Ketahuilah, sesungguhnya pada setiap seratus tahun tidak ada seorang pun yang hidup di atas bumi akan tersisa.\"","created_at":"2017-07-17 04:03:57","updated_at":"2017-07-17 04:03:57"},{"id":162,"id_bab":114,"isi":"Telah menceritakan kepada kami Muslim bin Ibrahim berkata, telah menceritakan kepada kami Syu'bah dari Sa'd bin Ibrahim dari Muhammad bin 'Amru -yaitu Ibnu Al Hasan bin 'Ali- ia berkata, \"Kami pernah bertanya kepada Jabir bin 'Abdullah tentang shalatnya Nabi shallallahu 'alaihi wasallam. Ia lalu menjawab, \"Beliau melaksanakan shalat Zhuhur jika matahari sudah condong, shalat 'Ashar saat matahari masih terasa panasnya (masih terang), shalat Maghrib ketika matahari sudah tenggelam, sedangkan shalat 'Isya; jika orang-orang sudah berkumpul maka beliau segerakan, dan jika belum maka beliau akhirkan. Dan waktu untuk shalat Subuh saat pagi masih gelap.\"","created_at":"2017-07-17 04:04:18","updated_at":"2017-07-17 04:04:18"},{"id":163,"id_bab":115,"isi":"Telah menceritakan kepada kami Yahya bin Bukair berkata, telah menceritakan kepada kami Al Laits dari 'Uqail dari Ibnu Syihab dari 'Urwah bahwa 'Aisyah mengabarkan kepadanya, ia katakan, \"Rasulullah shallallahu 'alaihi wasallam pernah melaksanakan shalat 'Isya ketika malam telah masuk sepertiga akhir malam ('Atamah), dan itu terjadi ketika Islam belum luas tersebar. Beliau tidak juga keluar hingga 'Umar berkata, 'Para wanita dan anakanak sudah tidur! ' Maka beliau pun keluar dan bersabda kepada orang-orang yang ada di Masjid: \"Tidak ada seorangpun dari penduduk bumi yang menunggu shalat ini selain kalian.\"","created_at":"2017-07-17 04:04:42","updated_at":"2017-07-17 04:04:42"},{"id":164,"id_bab":115,"isi":"Telah menceritakan kepada kami Muhammad bin Al 'Ala berkata, telah mengabarkan kepada kami Abu Umamah dari Buraid dari Abu Burdah dari Abu Musa ia berkata, \"Aku dan sahabat-sahabatku yang pernah ikut dalam perahu singgah pada tanah lapang yang memiliki aliran air, sedangkan Nabi shallallahu 'alaihi wasallam berada di Madinah. Di antara mereka ada beberapa orang yang saling bergantian mengikuti Nabi shallallahu 'alaihi wasallam shalat 'Isya di setiap malamnya. Hingga pada suatu malam, aku dan para sahabatku menjumpai Nabi shallallahu 'alaihi wasallam yang saat itu sedang sibuk dengan urusannya, sehingga beliau mengakhirkan pelaksanaan shalatr 'Isya hingga pada pertengahan malam. Maka Nabi shallallahu 'alaihi wasallam keluar untuk menunaikan shalat bersama mereka. Selesai shalat beliau bersabda kepada orang-orang yang hadir: \"Tetaplah kalian di tempat kalian, dan bergemberilah. Sesungguhnya termasuk dari nikmat Allah kepada kalian adalah didapatinya seorang pun saat ini yang melaksanakan shalat (Isya) selain kalian.\" Atau Beliau bersabda: \"Tidak ada yang melaksanakan shalat pada waktu seperti ini kecuali kalian.\" Namun ia terlupa mana dari dua kalimat ini yang dikatakan beliau. Abu Burdah berkata, Abu Musa, \"Maka kami kembali dengan gembira dengan apa yang kami dengar dari Rasulullah shallallahu 'alaihi wasallam.\"","created_at":"2017-07-17 04:04:52","updated_at":"2017-07-17 04:04:52"},{"id":165,"id_bab":116,"isi":"Telah menceritakan kepada kami Muhammad bin Salam berkata, telah mengabarkan kepada kami 'Abdul Wahhab Ats Tsaqafi berkata, telah menceritakan kepada kami Khalid Al Hadza' dari Abu Al Minhal dari Abu Barzah, bahwa Rasulullah shallallahu 'alaihi wasallam tidak suka tidur sebelum shalat 'Isya dan berbincang-bincang setelahnya.\"","created_at":"2017-07-17 04:05:10","updated_at":"2017-07-17 04:05:10"},{"id":166,"id_bab":117,"isi":"Telah menceritakan kepada kami Ayyub bin Sulaiman -yaitu Ibnu Bilal- ia berkata, telah menceritakan kepadaku Abu Bakar dari Sulaiman -yaitu Ibnu Bilal- berkata, telah menceritakan kepada kami Shalih bin Kaisan telah mengabarkan kepadaku Ibnu Syihab dari 'Urwahl bahwa 'Aisyah berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengakhirkan shalat 'Isya hingga sepertiga malam yang akhir. Lalu 'Umar pun berseru kepada beliau, \"(Laksanakanlah) shalat, sebab para wanita dan anak-anak telah terlelap tidur.\" Maka keluarlah beliau seraya berkata: \"Tidak ada seorangpun dari penduduk bumi yang menunggu shalat Isya ini selain kalian.\" Beliau tidaklah melaksanakan shalat seperti ini kecuali di Madinah. Dan mereka melaksnakan shalat antara hilangnya syafaq (cahaya kemerahan di langit) hingga sepertiga awal dari malam.\"","created_at":"2017-07-17 04:05:28","updated_at":"2017-07-17 04:05:28"},{"id":167,"id_bab":117,"isi":"Telah menceritakan kepada kami Mahmud -yaitu Ibnu Ghailan- berkata, telah mengabarkan kepada kami Abdurrazaq berkata, telah mengabarkan kepadaku Ibnu Juraij berkata, telah mengabarkan kepadaku Nafi' berkata, telah menceritakan kepada kami 'Abdullah bin 'Umar, bahwa Rasulullah shallallahu 'alaihi wasallam pernah suatu malam disibukkan dengan urusan sehingga mengakhirkan shalat 'Isya. Dan karenanya kami tertidur di dalam masjid. Lalu kami terbangun, lalu tertidur, lalu terbangun lagi hingga akhirnya Rasulullah shallallahu 'alaihi wasallam keluar menemui kami seraya bersabda: \"Tidak ada seorangpun dari penduduk bumi yang menunggu shalat seperti ini selain kalian.\" Dan Ibnu 'Umar tidak mempermasalahkan apakah Beliau memajukannya atau mengakhirkan. Pelaksanakaannya. Dan Ibnu Umar tidur dahulu sebelum shalat Isya. Ibnu Juraij berkata, \"Aku bertanya kepada 'Atha', lalu dia berkata, \"Aku mendengar Ibnu 'Abbas berkata, \"Pernah suatu malam Rasulullah shallallahu 'alaihi wasallam mengakhirkan shalat 'Isya hingga banyak orang tertidur, kemudian mereka terbangun, lalu tertidur lagi, kemudian terbangun lagi.\" 'Umar bin Al Khaththab lalu berdiri dan berkata, \"Shalat.\" 'Atha' berkata, Ibnu 'Abbas, \"Maka Nabi shallallahu 'alaihi wasallam kemudian keluar dengan meletakkan tangan pada kepala, seakan aku melihat rambut beliau basah meneteskan air. Beliau kemudiaan bersabda: \"Seandainya tidak memberatkan ummatku, niscaya aku akan perintahkan mereka melaksanakan shalat 'Isya seperti waktu sekarang ini.\" Aku (Ibnu Juraij) kemudian menanyakan kepada 'Atha untuk memastikan kenapa Nabi shallallahu 'alaihi wasallam meletakkan tangannya di kepalanya seabgaimana yang diberitakan oleh Ibnu 'Abbas. Maka 'Atha merenggangkan sedikit jari-jarinya kemudian meletakkan ujung jarinya di atas sisi kepala, kemudian ia menekannya sambil menggerakkan ke sekeliling kepala hingga ibu jarinya menyentuh ujung telinga yang dimulai dari pelipis hingga pangkal jenggot. Dia melakukannya tidak pelan juga tidak cepat, kecuali sedang seperti itu. Lalu Beliau bersabda: \"Seandainya tidak memberatkan ummatku, niscaya aku akan perintahkan mereka melaksanakan shalat seperti waktu sekarang ini.\"","created_at":"2017-07-17 04:05:40","updated_at":"2017-07-17 04:05:40"},{"id":168,"id_bab":118,"isi":"Telah menceritakan kepada kami 'Abdurrahim Al Muharibi berkata, telah menceritakan kepada kami Zaidah dari Humaid Ath Thawil dari Anas bin Malik berkata, \"Nabi shallallahu 'alaihi wasallam pernah mengakhirkan shalat 'Isya hingga pertengahan malam, setelah melaksanakan shalat beliau bersabda: \"Manusia semuanya sudah selesai shalat lalu mereka \r\ntidur. Dan kalian akan senantiasa dalam hitungan shalat selama kalian menunggu pelaksanaannya.\" Ibnu Abu Maryam menambahkan; telah mengabarkan kepada kami Yahya bin Ayyub telah menceritakan kepadaku Humaid dia mendengar Anas bin Malik berkata, \"Pada malam itu aku seolah melihat cahaya cincin Beliau.\"","created_at":"2017-07-17 04:05:54","updated_at":"2017-07-17 04:05:54"},{"id":169,"id_bab":119,"isi":"Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepada kami Yahya dari Isma'il telah menceritakan kepada kami Qais, Jarir bin 'Abdullah berkata kepadaku, \"Kami sedang bersama Nabi shallallahu 'alaihi wasallam saat beliau melihat rembulan di malam purnama. Kemudian beliau bersabda: \"Sesungguhnya kalian akan melihat Rabb kalian sebagaimana kalian melihat bulan purnama ini. Dan kalian tidak akan saling berdesakan dalam melihatnya. Maka jika kalian mampu untuk tidak terlewatkan melaksanakan shalat sebelum terbit matahari dan sebelum terbenamnya, maka lakukanlah, \" Kemudian beliau membaca: '(Maka bertasbihlah sambil memuji Rabbmu sebelum terbit matahari dan sebelum terbenamnya) ' (Qs. Qaaf: 38).","created_at":"2017-07-17 04:06:14","updated_at":"2017-07-17 04:06:14"},{"id":170,"id_bab":119,"isi":"Telah menceritakan kepada kami Hudbah bin Khalid berkata, telah menceritakan kepada kami Hammam telah menceritakan kepadaku Abu Jamrah dari Abu Bakar bin Abu Musa dari Bapaknya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengerjakan shalat pada dua waktu dingin, maka dia akan masuk surga.\" Ibnu Raja' berkata; telah menceritakan kepada kami Hammam dari Abu Jamrah bahwa Abu Bakar bin 'Abdullah bin Qais telah mengabarkan kepadanya seperti ini.\" Dan telah menceritakan kepada kami Ishaq telah menceritakan kepada kami Habban telah menceritakan kepada kami Hammam telah menceritakan kepada kami Abu Jamrah dari Abu Bakar bin 'Abdullah dari Bapaknya dari Nabi shallallahu 'alaihi wasallam seperti ini.\"","created_at":"2017-07-17 04:06:21","updated_at":"2017-07-17 04:06:21"},{"id":171,"id_bab":120,"isi":"Telah menceritakan kepada kami 'Amru bin 'Ashim berkata, telah menceritakan kepada kami Hammam dari Qatadah dari Anas bin Malik bahwa Zaid bin Tsabit telah menceritakan kepadanya, bahwa mereka pernah sahur bersama Nabi shallallahu 'alaihi wasallam, kemudian mereka berdiri untuk melaksanakan shalat.\" Aku bertanya, \"Berapa jarak antara sahur dengan shalat subuh?\" Dia menjawab, \"Antara lima puluh hingga enam puluh ayat.\"","created_at":"2017-07-17 04:06:38","updated_at":"2017-07-17 04:06:38"},{"id":172,"id_bab":120,"isi":"Telah menceritakan kepada kami Hasan bin Shabbah telah mendengar Rauh bin 'Ubadah telah menceritakan kepada kami Sa'id dari Qatadah dari Anas bin Malik, bahwa Nabi shallallahu 'alaihi wasallam dan Zaid bin Tsabit makan sahur bersama. Setelah keduanya selesai makan sahur, beliau lalu bangkit melaksanakan shalat.\" Kami bertanya kepada Anas, \"Berapa rentang waktu antara selesainya makan sahur hingga keduanya melaksanakan shalat?\" Anas bin Malik menjawab, \"Kira-kira waktu seseorang membaca lima puluh ayat.\"","created_at":"2017-07-17 04:06:47","updated_at":"2017-07-17 04:06:47"},{"id":173,"id_bab":120,"isi":"Telah menceritakan kepada kami Isma'il bin Abu Uwais dari Saudaranya dari Sulaiman dari Abu Hazm bahwa dia mendengar Sahl bin Sa'd berkata, \"Suatu kali aku pernah makan sahur bersama keluargaku, kemudian aku bersegera agar dapat melaksanakan shalat Subuh bersama Rasulullah shallallahu 'alaihi wasallam.\"","created_at":"2017-07-17 04:06:54","updated_at":"2017-07-17 04:06:54"},{"id":174,"id_bab":120,"isi":"Telah menceritakan kepada kami Yahya bin Bukair berkata, telah mengabarkan kepada kami Al Laits dari 'Uqail dari Ibnu Syuhab berkata, telah mengabarkan kepadaku 'Urwah bin Az Zubair bahwa 'Aisyah mengabarkan kepadanya, ia mengatakan, \"Kami, wanita-wanita Mukminat, pernah ikut shalat fajar bersama Rasulullah shallallahu 'alaihi wasallam dengan menutup wajahnya dengan kerudung, kemudian kembali ke rumah mereka masing-masing setelah selesai shalat tanpa diketahui oleh seorangpun karena hari masih gelap.\"","created_at":"2017-07-17 04:07:01","updated_at":"2017-07-17 04:07:01"},{"id":175,"id_bab":121,"isi":"Telah menceritakan kepada kami 'Abdullah bin Maslamah dari Malik dari Zaid bin Aslam dari 'Atha bin Yasar, dan dari Busr bin Sa'id, dan dari Al A'raj mereka semua menceritakan dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapatkan satu rakaat dari shalat subuh sebelum terbit matahari berarti dia mendapatkan subuh. Dan siapa yang mendapatkan satu rakaat dari shalat 'Ashar sebelum terbenam matahari berarti dia telah mendapatkan 'Ashar.","created_at":"2017-07-17 04:07:34","updated_at":"2017-07-17 04:07:34"},{"id":176,"id_bab":122,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Ibnu Syihab dari Abu Salamah bin 'Abdurrahman dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapatkan satu rakaat dari shalat berarti dia telah mendapatkan shalat.\"","created_at":"2017-07-17 04:07:54","updated_at":"2017-07-17 04:07:54"},{"id":177,"id_bab":123,"isi":"Telah menceritakan kepada kami Hafsh bin 'Umar berkata, telah menceritakan kepada kami Hisyam dari Qatadah dari Abu Al Aliyah dari Ibnu 'Abbas berkata, \"Orang-orang yang \r\ndiridlai mempersaksikan kepadaku dan di antara mereka yang paling aku ridlai adalah 'Umar, (mereka semua mengatakan) bahwa Nabi shallallahu 'alaihi wasallam melarang shalat setelah Shubuh hingga matahari terbit, dan setelah 'Ashar sampai matahari terbenam.\" Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepada kami Yahya dari Syu'bah dari Qatadah aku mendengar Abu Al Aliyah dari Ibnu 'Abbas berkata, \"Orangorang (para sahabat) menceritakan hadits ini kepadaku.\"","created_at":"2017-07-17 04:08:10","updated_at":"2017-07-17 04:08:10"},{"id":178,"id_bab":123,"isi":"Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepada kami Yahya bin Sa'id dari Hisyam berkata, telah mengabarkan kepadaku Bapakku berkata, telah mengabarkan kepadaku Ibnu 'Umar berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian sengaja melaksanakan shalat ketika matahari sedang terbit dan juga ketika terbenamnya.\" Dan telah menceritakan kepadaku Ibnu 'Umar berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika matahari sedang terbit maka tundalah shalat hingga telah meninggi, dan jika matahari sedang terbenam maka tundalah shalat hingga menghilang.\" Hadits ini juga kuatkan oleh 'Abdah.","created_at":"2017-07-17 04:08:17","updated_at":"2017-07-17 04:08:17"},{"id":179,"id_bab":123,"isi":"Telah menceritakan kepada kami 'Ubaid bin Isma'il dari Abu Usamah dari 'Ubaidullah dari Khubaib bin 'Abdurrahman dari Hafsh bin 'Ashim dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari dua macam jual beli, dua cara berpakaian dan dua shalat. Beliau melarang shalat setelah Shubuh sampai terbit matahari dan setelah 'Ashar sampai matahari terbenam. Melarang dari pakaian shama` dan duduk ihtiba` dengan satu kain sehingga menghadapkan kemaluannya ke langit. Dan beliau juga melarang dari jual beli Al Munabadzah dan Al Mulasamah.\"","created_at":"2017-07-17 04:08:25","updated_at":"2017-07-17 04:08:25"},{"id":180,"id_bab":124,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Nafi' dari Ibnu 'Umar, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian sengaja shalat ketika matahari sedang terbit dan atau ketika saat terbenam.\"","created_at":"2017-07-17 04:08:52","updated_at":"2017-07-17 04:08:52"},{"id":181,"id_bab":124,"isi":"Telah menceritakan kepada kami 'Abdul 'Aziz bin 'Abdullah berkata, telah menceritakan kepada kami Ibrahim bin Sa'd dari Shalih dari Ibnu Syihab berkata, telah mengabarkan kepadaku 'Atha bin Yazid Al Junda'i bahwa dia mendengar Abu Sa'id Al Khudri berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada shalat setelah Shubuh hingga matahari meninggi dan tidak ada shalat setelah 'Ashar hingga matahari menghilang.\"","created_at":"2017-07-17 04:08:59","updated_at":"2017-07-17 04:08:59"},{"id":182,"id_bab":124,"isi":"Telah menceritakan kepada kami Muhammad bin Aban berkata, telah menceritakan kepada kami Ghundar berkata, telah menceritakan kepada kami Syu'bah dari Abu At Tiyah berkata, aku mendengar Humran bin Aban menceritakan dari Mu'awiyyah berkata, \"Sungguh kalian telah mengerjakan suatu shalat (yang dilarang). Kami telah mendampingi Rasulullah shallallahu 'alaihi wasallam, dan kami tidak pernah melihat beliau melaksanakannya. Beliau telah melarang keduanya, yaitu dua rakaat setelah shalat 'Ashar.\"","created_at":"2017-07-17 04:09:08","updated_at":"2017-07-17 04:09:08"},{"id":183,"id_bab":124,"isi":"Telah menceritakan kepada kami Muhammad bin Salam berkata, telah menceritakan kepada kami 'Abdah dari 'Ubaidullah dari Khubaib dari Hafsh bin 'Ashim dari Abu Hurairah berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari dua macam shalat; dua rakaat setelah Shubuh hingga terbit matahari dan dua rakaat setelah 'Ashar hingga matahari terbenam.\"","created_at":"2017-07-17 04:09:16","updated_at":"2017-07-17 04:09:16"},{"id":184,"id_bab":125,"isi":"Telah menceritakan kepada kami Abu An Nu'man telah menceritakan kepada kami Hammad bin Zaid dari Ayyub dari Nafi' dari Ibnu 'Umar berkata, \"Aku melaksanakan shalat sebagaimana aku melihat para sahabatku melaksanakannya. Aku tidak melarang seorangpun untuk melaksanakan shalat baik di malam hari maupun di siang hari, kecuali bila kalian sengaja mengerjakannya saat matahari sedang terbit atau ketika sedang terbenamnya.\"","created_at":"2017-07-17 04:09:30","updated_at":"2017-07-17 04:09:30"},{"id":185,"id_bab":126,"isi":"Telah menceritakan kepada kami 'Imran bin Maisarah berkata, telah menceritakan kepada kami Muhammad bin Fudlail berkata, telah menceritakan kepada kami Hushain dari \r\n'Abdullah bin Abu Qatadah dari Bapaknya berkata, \"Kami pernah berjalan bersama Nabi shallallahu 'alaihi wasallam pada suatu malam. Sebagian kaum lalu berkata, \"Wahai Rasulullah, sekiranya Tuan mau istirahat sebentar bersama kami?\" Beliau menjawab: \"Aku khawatir kalian tertidur sehingga terlewatkan shalat.\" Bilal berkata, \"Aku akan membangunkan kalian.\" Maka merekapun berbaring, sedangkan Bilal bersandar pada hewan tunggannganya, tapi rasa kantuknya mengalahkannya dan akhirnya iapun tertidur. Ketika Nabi shallallahu 'alaihi wasallam terbangun ternyata matahari sudah terbit, maka beliau pun bersabda: \"Wahai Bilal, mana bukti yang kau ucapkan!\" Bilal menjawab: \"Aku belum pernah sekalipun merasakan kantuk seperti ini sebelumnya.\" Beliau lalu bersabda: \"Sesungguhnya Allah Azza Wa Jalla memegang ruh-ruh kalian sesuai kehendak-Nya dan mengembalikannya kepada kalian sekehendak-Nya pula. Wahai Bilal, berdiri dan adzanlah (umumkan) kepada orang-orang untuk shalat!\" kemudian beliau berwudlu, ketika matahari meninggi dan tampak sinar putihnya, beliau pun berdiri melaksanakan shalat.\"","created_at":"2017-07-17 04:09:56","updated_at":"2017-07-17 04:09:56"},{"id":186,"id_bab":127,"isi":"Telah menceritakan kepada kami Mu'adz bin Fadlalah berkata, telah menceritakan kepada kami Hisyam dari Yahya dari Abu Salamah dari Jabir bin 'Abdullah, bahwa 'Umar bin Al Khaththab datang pada hari peperangan Khandaq setelah matahari terbenam hingga ia mengumpat orang-orang kafir Quraisy, lalu ia berkata, \"Wahai Rasulullah, aku belum melaksanakan shaat 'Ashar hingga matahari hampir terbenam!\" Maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Demi Allah, aku juga belum melakasanakannya.\" Kemudian kami berdiri menuju aliran air (sungai), beliau berwudlu dan kami pun ikut berwudlu, kemudian beliau melaksanakan shalat 'Ashar setelah matahari terbenam, dan setelah itu dilanjutkan dengan shalat Maghrib.\"","created_at":"2017-07-17 04:10:18","updated_at":"2017-07-17 04:10:18"},{"id":187,"id_bab":128,"isi":"Telah menceritakan kepada kami Abu Nu'aim dan Musa bin Isma'il keduanya berkata, telah menceritakan kepada kami Hammam dari Qatadah dari Anas bin Malik dari Nabi \r\nshallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa lupa suatu shalat, maka hendaklah dia melaksanakannya ketika dia ingat. Karena tidak ada tebusannya kecuali itu. Allah berfirman: '(Dan tegakkanlah shalat untuk mengingat-Ku) ' (Qs. Thaahaa: 14). Musa berkata, Hammam berkata, \"Setelah itu aku mendengar beliau mengucapkan: '(Dan tegakkanlah shalat untuk mengingat-Ku) ' Abu 'Abdullah berkata; Habban berkata, telah menceritakan kepada kami Hammam telah menceritakan kepada kami Qatadah telah menceritakan kepada kami Anas bin Malik dari Nabi shallallahu 'alaihi wasallam seperti itu.\"","created_at":"2017-07-17 04:10:42","updated_at":"2017-07-17 04:10:42"},{"id":188,"id_bab":129,"isi":"Telah menceritakan kepada kami 'Imran bin Maisarah telah menceritakan kepada kami 'Abdul Warits telah menceritakan kepada kami Khalid Al Hadza' dari Abu Qilabah dari Anas bin Malik berkata, \"Orang-orang menyebut-nyebut tentang api dan lonceng (dalam mengusulkan cara memanggil shalat). Lalu ada juga di antara mereka yang mengusulkan seperti kebiasaan orang-orang Yahudi dan Nahrani. Maka Bilal diperintahkan untuk mengumandangkan adzan dengan dua kali dua kali dan iqamat dengan bilangan ganjil.\"","created_at":"2017-07-17 04:11:28","updated_at":"2017-07-17 04:11:28"},{"id":189,"id_bab":129,"isi":"Telah menceritakan kepada kami Mahmud bin Ghailan berkata, telah menceritakan kepada kami Abdurrazaq berkata, telah mengabarkan kepada kami Ibnu Juraij berkata, telah mengabarkan kepadaku Nafi' bahwa Ibnu 'Umar berkata, \"Ketika Kaum Muslimin tiba di Madinah, mereka berkumpul untuk shalat dengan cara memperkirakan waktunya, dan tidak ada panggilan untuk pelaksanaan shalat. Suatu hari mereka memperbincangkan masalah tersebut, di antara mereka ada yang mengusulkan lonceng seperi loncengnya Kaum Nashrani dan sebagaian lain mengusulkan untuk meniup terampet sebagaimana Kaum Yahudi. Maka 'Umar pun berkata, \"Mengapa tidak kalian suruh seseorang untuk mengumandangkan panggilan shalat?\" Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Wahai Bilal, bangkit dan serukanlah panggilan shalat.\"","created_at":"2017-07-17 04:11:39","updated_at":"2017-07-17 04:11:39"},{"id":190,"id_bab":130,"isi":"Telah menceritakan kepada kami 'Ali bin 'Abdullah telah menceritakan kepada kami Isma'il bin Ibrahim telah menceritakan kepada kami Khalid dari Abu Qilabah dari Anas bin Malik berkata, \"Bilal diperintahkan untuk mengumandangkan kalimat adzan dengan genap (dua kali dua kali) dan mengganjilkan iqamat.\" Isma'il berkata, \"Aku sampaikan masalah ini kepada Ayyub, lalu ia berkata, 'Kecuali kalimat iqamat 'Qad qaamatish shalah (shalat telah dikumandangkan) '.\"","created_at":"2017-07-17 04:12:25","updated_at":"2017-07-17 04:12:25"},{"id":191,"id_bab":131,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Abu Az Zinad dari Al A'raj dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika panggilan shalat (adzan) dikumandangkan maka setan akan lari sambil mengeluarkan kentut hingga ia tidak mendengar suara adzan. Apabila panggilan adzan telah selesai maka setan akan kembali. Dan bila iqamat dikumandangkan setan kembali berlari dan jika iqamat telah selesai dikumandangkan dia kembali lagi, lalu \r\nmenyelinap masuk kepada hati seseorang seraya berkata, 'Ingatlah ini dan itu'. Dan terus saja dia melakukan godaan ini hingga seseorang tidak menyadari berapa rakaat yang sudah dia laksanakan dalam shalatnya.\"","created_at":"2017-07-17 04:13:22","updated_at":"2017-07-17 04:13:22"},{"id":192,"id_bab":132,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Abdurrahman bin Abdullah bin 'Abdurrahman bin Abu Sha'sha'ah Al Anshari Al Mazini dari Bapaknya bahwa ia mengabarkan kepadanya, bahwa Abu Sa'id Al Khudri berkata kepadanya, \"Aku lihat kamu suka kambing dan lembah (pengenmbalaan). Jika kamu sedang mengembala kambingmu atau berada di lembah, lalu kamu mengumandangkan adzan shalat, maka keraskanlah suaramu. Karena tidak ada yang mendengar suara mu'adzin, baik manusia, jin atau apapun dia, kecuali akan menjadi saksi pada hari kiamat.\" Abu Sa'id berkata, \"Aku mendengarnya dari Rasulullah shallallahu 'alaihi wasallam.\"","created_at":"2017-07-17 04:13:37","updated_at":"2017-07-17 04:13:37"},{"id":193,"id_bab":133,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Ibnu Syihab dari 'Atha bin Yazid Al Laitsi dari Abu Sa'id Al Khudri, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian mendengar adzan, maka jawablah seperti apa yang diucapkan mu'adzin.\"","created_at":"2017-07-17 04:13:59","updated_at":"2017-07-17 04:13:59"},{"id":194,"id_bab":133,"isi":"Telah menceritakan kepada kami Mu'adz bin Fadlalah berkata, telah menceritakan kepada kami Hisyam dari Yahya dari Muhammad bin Ibrahim bin Al Harits berkata, telah menceritakan kepadaku 'Isa bin Thalhah, bahwa pada suatu hari dia mendengar Mu'awiyyah mengucapkan seperti (apa yang diucapkan mu'adzin) hingga ucapannya: \"Wa asyhadu anna Muhammadar Rasulullah.\"","created_at":"2017-07-17 04:14:07","updated_at":"2017-07-17 04:14:07"},{"id":195,"id_bab":133,"isi":"Telah menceritakan kepada kami Ishaq bin Rahawaih berkata, telah menceritakan kepada kami Wahab bin Jarir berkata, telah menceritakan kepada kami Hisyam dari Yahya seperti itu, Yahya berkata, dan telah menceritakan kepadaku Sebagian saudara kami bahwa dia berkata, \"Jika mu'adzin mengucapkan, 'Hayya 'Alash shalah '(Marilah melaksanakan shalat) ', dia menjawab, \"Laa Haula Walaa Quwwata Illaa Billah '(Tidak ada daya dan kekuatan melainkan dengan izin Allah) '. Dia berkata, \"Demikianlah kami mendengar Nabi kalian shallallahu 'alaihi wasallam bersabda.\"","created_at":"2017-07-17 04:14:16","updated_at":"2017-07-17 04:14:16"},{"id":196,"id_bab":134,"isi":"Telah menceritakan kepada kami 'Ali bin 'Ayyasy berkata, telah menceritakan kepada kami Syu'aib bin Abu Hamzah dari Muhammad Al Munkadir dari Jabir bin 'Abdullah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berdo'a setelah mendengar adzan: ALLAHUMMA RABBA HAADZIHID DA'WATIT TAMMAH WASHSHALAATIL QAA'IMAH. AATI MUHAMMADANIL WASIILATA WALFADLIILAH WAB'ATSHU MAQAAMAM MAHMUUDANIL LADZII WA'ADTAH (Ya Allah. Rabb Pemilik seruan yang sempurna ini, dan Pemilik shalat yang akan didirikan ini, berikanlah wasilah (perantara) dan keutamaan kepada Muhammad. Bangkitkanlah ia pada kedudukan yang terpuji sebagaimana Engkau telah jannjikan) '. Maka ia berhak mendapatkan syafa'atku pada hari kiamat.\"","created_at":"2017-07-17 04:14:42","updated_at":"2017-07-17 04:14:42"},{"id":197,"id_bab":135,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Sumayya mantan budak Abu Bakar, dari Shalih dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya manusia mengetahui apa (kebaikan) yang terdapat pada adzan dan shaf awal, lalu mereka tidak akan mendapatkannya kecuali dengan cara mengundi, niscaya tmereka akan melakukannya. Dan seandainya mereka mengetahui kebaikan yang terdapat dalam bersegera (menuju shalat), niscaya mereka akan berlomba-lomba. Dan seandainya mereka mengetahui kebaikan yang terdapat pada shalat 'Isya dan Shubuh, niscaya mereka akan mendatanginya walaupun harus dengan merangkak.\"","created_at":"2017-07-17 04:14:59","updated_at":"2017-07-17 04:14:59"},{"id":198,"id_bab":136,"isi":"Telah menceritakan kepada kami Musaddad berkata, telah menceritakan kepada kami Hammad dari Ayyub dan 'Abdul Hamid sahabat Az Zayadi, dan 'Ashim Al Ahwal dari 'Abdullah bin Al Harits berkata, \"Pada suatu hari ketika jalan penuh dengan air dan lumpur (becek) akibat hujan, Ibnu 'Abbas pernah menyampaikan khuthbah kepada kami. Ketika mu'adzin sampai pada ucapan: 'Hayya 'Alash shalaah (Marilah mendirikan shalat) ' ia perintahkan mu'adzin tersebut untuk menyerukan: 'Shalatlah di tempat tinggal masingmasing'. Lalu orang-orang saling memandang satu sama lain karena heran. Maka Abdullah bin Al Harits pun berkata, \"Hal yang demikian ini pernah dilakukan oleh orang yang lebih baik darinya, dan itu merupakan kewajiban Mu'akkad (yang ditekankan).\"","created_at":"2017-07-17 04:15:21","updated_at":"2017-07-17 04:15:21"},{"id":199,"id_bab":137,"isi":"Telah menceritakan kepada kami Abu Al Yaman berkata, telah mengabarkan kepada kami Syu'aib berkata, telah menceritakan kepada kami Abu Az Zinad banwa 'Abdurrahman bin Hurmuz Al A'raj mantan budak Rabi'ah bin Al Harits, menceritakan kepadanya bahwasanya dia mendengar Abu Hurairah radliallahu 'anhu, bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita datang terakhir dan pertama pada hari kiamat, meskipun mereka diberi Kitab sebelum kita. Dan ini adalah hari dimana mereka mendapat kewajiban, namun kemudian mereka berselisih di dalamnya. Allah lalu memberi hidayah kepada kita, maka semua manusia akan mengikuti kita (hari ini), besok hari untuk Yahudi dan Nashrani hari setelahnya lagi.\"","created_at":"2017-07-17 04:16:15","updated_at":"2017-07-17 04:16:15"},{"id":200,"id_bab":138,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Nafi' dari 'Abdullah bin 'Umar radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorangii kalian mendatangi shalat jum'at hendaklah ia mandi.\"","created_at":"2017-07-17 04:16:33","updated_at":"2017-07-17 04:16:33"},{"id":201,"id_bab":138,"isi":"Telah menceritakan kepada kami 'Abdullah bin Muhammad bin Asma' berkata, telah mengabarkan kepada kami Juwairiyah bin Asma' dari Malik dari Az Zuhri dari Salim bin \r\n'Abdullah bin 'Umar dari Ibnu Umar radliallahu 'anhuma, bahwa ketika 'Umar bin Al Khaththab berdiri khuthbah pada hari Jum'at, tiba-tiba ada seorang laki-laki Muhajirin Al Awwalin (generasi pertama), sahabat Nabi shallallahu 'alaihi wasallam, masuk (ke dalam Masjid). Maka 'Umar pun bertanya, \"Jam berapakah ini?\" Sahabat tersebut menjawab, \"Aku sibuk, dan aku belum sempat pulang ke rumah hingga akhirnya aku mendengar adzan dan aku hanya bisa berwudlu.\" Umar berkata, \"Hanya berwudlu' saja! Sungguh kamu sudah mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk mandi (di hari Jum'at).\"","created_at":"2017-07-17 04:16:42","updated_at":"2017-07-17 04:16:42"},{"id":202,"id_bab":138,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Shafwan bin Sulaim dari 'Atha' bin Yasar dari Abu Sa'id Al Khudri radliallahu 'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari Jum'at adalah wajib bagi setiap orang yang sudah baligh.\"","created_at":"2017-07-17 04:16:47","updated_at":"2017-07-17 04:16:47"},{"id":203,"id_bab":139,"isi":"Telah menceritakan kepada kami 'Ali bin 'Abdullah bin Ja'far berkata, telah menceritakan kepada kami Harami bin 'Umarah berkata, telah menceritakan kepadaku Syu'bah dari Abu Bakar bin Al Munkadir berkata, telah menceritakan kepadaku 'Amru bin Sulaim Al Anshari berkata, \"Aku bersaksi atas Abu Sa'id Al Khudri ia berkata, \"Aku bersaksi atas Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Mandi pada hari Jum'at merupakan kewajiban bagi orang yang sudah bermimpi (baligh), dan agar bersiwak (menggosok gigi) dan memakai wewangian bila memilikinya.\" 'Amru berkata, \"Adapun mandi, aku bersaksi bahwa itu adalah wajib. Sedangkan bersiwak dan memakai wewangian dan Allah yang lebih tahu- aku tidak tahu ia wajib atau tidak, tapi begitulah yang ada dalam hadits.\" Abu 'Abdullah -yaitu saudara Muhammad bin Al Munkadir, dan tidak disbeut dengan nama Abu Bakar- berkata, 'Hadits ini diriwayatkan darinya oleh Bukair bin Al Asyaj dan Sa'id bin Abu Hilal dan masih banyak lagi.' Dan Muhammad bin Al Munkadir punya nama panggilan Abu Bakar dan 'Abdullah.\"","created_at":"2017-07-17 04:17:01","updated_at":"2017-07-17 04:17:01"},{"id":204,"id_bab":140,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Sumayya mantan budak Abu Bakar bin 'Abdurrahman, dari Abu Shalih As Saman dari Abu Hurairah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mandi pada hari Jum'at sebagaimana mandi janabah, lalu berangkat menuju Masjid, maka dia seolah berkurban seekor unta. Dan barangiapa datang pada kesempatan (saat) kedua maka dia seolah berkurban seekor sapi. Dan barangiapa datang pada kesempatan (saat) ketiga maka dia seolah berkurban seekor kambing yang bertanduk. Dan barangiapa datang pada kesempatan (saat) keempat maka dia seolah berkurban seekor ayam. Dan barangiapa datang pada kesempatan (saat) kelima maka dia seolah berkurban sebutir telur. Dan apabila imam sudah keluar (untuk memberi khuthbah), maka para Malaikat hadir mendengarkan dzikir (khuthbah tersebut).\"","created_at":"2017-07-17 04:17:16","updated_at":"2017-07-17 04:17:16"},{"id":205,"id_bab":140,"isi":"Telah menceritakan kepada kami Abu Nu'aim berkata, telah menceritakan kepada kami Syaiban dari Yahya -yaitu Ibnu Abu Katsir- dari Abu Salamah dari Abu Hurairah bahwa 'Umar radliallahu 'anhu ketika berdiri memberikah khuthbah pada hari Jum'at, tiba-tiba ada seorang laki-laki masuk (Masjid). 'Umar lalu bertanya, \"Kenapa anda terlambat shalat?\" Lakilaki itu menjawab: \"Aku tidak tahu hingga aku mendengar adzan, maka aku pun hanya berwudlu.\" Maka \"Umar berkata, \"Bukankah kamu sudah mendengar bahwa Nabi shallallahu 'alaihi wasallam bersabda: 'Jika salah seorang dari kalian berangkat shalat jum'at hendaklah mandi.\"","created_at":"2017-07-17 04:17:24","updated_at":"2017-07-17 04:17:24"},{"id":206,"id_bab":141,"isi":"Telah menceritakan kepada kami 'Abdullah bin Yusuf berkata, telah mengabarkan kepada kami Malik dari Nafi' dari 'Abdullah bin 'Umar, bahwa 'Umar bin Al Khaththab melihat pakaian sutera di depan pintu masjid, maka ia pun berkata, \"Wahai Rasulullah, seandainya tuan beli pakaian ini lalu tuan kenakan pada hari Jum'at atau saat menyambut utusan (delegasi) bila datang menghadap tuan.\" Rasulullah shallallahu 'alaihi wasallam lalu menjawab: \"Sesungguhnya orang yang memakai pakaian seperti ini tidak akan mendapat bagian di akhirat.\" Kemudian datang hadiah untuk Rasulullah shallallahu 'alaihi wasallam yang diantaranya ada pakain sutera. Beliau lalu memberikan pakaian sutera tersebut kepada 'Umar bin Al Khaththab? radliallahu 'anhu, maka berkatalah 'Umar, \"Wahai Rasulullah, tuan telah memberikan pakaian ini untukku, padahal tuan telah menjelaskan konsekwensi orang yang memakainya!\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku memberikannya kepadamu bukan untuk kamu pakai.\" Maka 'Umar bin Al Khaththab memberikan pakaian sutera tersebut kepada saudaranya yang musyrik di kota Makkah.\"","created_at":"2017-07-17 04:17:35","updated_at":"2017-07-17 04:26:30"}]